let pTitreThematique = document.createElement("p")
pTitreThematique.setAttribute('class', 'pTitreThematique')



// - Islam religion unique
const souratesIslamReligionUnique= [3,3,3,6,9,61,86,86];
const versetsIslamReligionUnique = [19,85,99,92,33,9,13,14];
const ahadithsIslamReligionUnique = [];
// Fin Islam Religion unique

// Hadith général sur les piliers de l'islam
const hadithPiliers = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 8,
    texte: "بُنِيَ الإسلامُ على خمسٍ",
    lien: "https://dorar.net/hadith/sharh/62472",
  },
];
// - A L L A H /  O M N I P O T E N T  /   O M N I S C i E N T
const souratesAllahOmnipotentOmniscient = [ 2, 2,  6, 6, 6, 7, 9, 11,11,11,11,11, 13, 16,16, 22,22,22,22,22, 32, 33, 35, 36, 40, 42,42, "C'est quoi...", 17]
const versetsAllahOmnipotentOmniscient = [ 181, 244, 18, 103, 115, 5,6, 1,2,3,4,5, 9, 8,40, 6,38,39,40,70, 5, 54, 2, 82, 68, 9,17, "l'âme?", 85]
let ahadithsAllahOmnipotentOmniscient = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero:4584,
    texte:"أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ",
    lien: "https://dorar.net/hadith/sharh/65277",
  },
];

// - Obéir à Allah et au prophète
const souratesObeirAllahProphete = [3,3,4,4,6,24,24,24,33,33,47,48,49,49,57,57]
const versetsObeirAllahProphete = [32,132,59,80,50,51,54,56,21,36,33,17,1,2,7,8]
const ahadithsObeirAllahProphete = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4584,
    texte:
      "أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ ",
    lien: "https://dorar.net/hadith/sharh/65277",
  },
  {
    auteur: "Abou Daoud أبو داود",
    numero: 4607,
    texte: "فعليكم بسنتي.  أوصيكم بتقوى اللهِ، والسَّمعِ والطاعةِ. ",
    lien: "https://dorar.net/hadith/sharh/72777",
  },
];
// Fin Obéir à Allah et au prophète

// Aimer le prophète plus que ....
const souratesAimerProphete = [33];
const versetsAimerProphete = [6];
const ahadithsAimerProphete = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 15,
    texte: "والذي نفسي بيدهِ لا يؤمنُ أحدُكم حتَّى أكونَ أحبَّ إليه من والدهِ وولدهِ والناسِ أجمعينَ",
    lien: "https://dorar.net/hadith/sharh/74978",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6632,
    texte: "والَّذي نَفْسِي بيَدِهِ، حتَّى أكُونَ أحَبَّ إلَيْكَ مِن نَفْسِكَ. الآنَ يا عُمَرُ.  ",
    lien: "https://dorar.net/hadith/sharh/13097",
  },
];
// Fin aimer le prophète

// C'est beau
const souratesBeau = [6,6,16,17,17,21,29,31,31,46,49,49,53,53];
const versetsBeau = [151,152,90,31,35,107,46,14,15,15,6,13,38,39];
const ahadithsBeau = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2409,
    texte: "كُلُّكُمْ رَاعٍ ومَسْؤُولٌ عن رَعِيَّتِهِ ",
    lien: "https://dorar.net/hadith/sharh/66037",
  },
  
];
// Fin c'est beau


// Allah / Les anges / Le diable
const souratesAllahAngesSatan = ["Allah vs ...", 2,2,2,2,2,2,2,2, 7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,17,17,17,17,17,18,22,38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,43,67];
const versetsAllahAngesSatan = ["les anges", 30,31,32,33,34,35,36,37, 11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,61,62,63,64,65,50,52,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,36,5];
const ahadithsAllahAngesSatan = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: " ",
    lien: "https://dorar.net/hadith/sharh/",
  },
];// Fin Allah / Les anges / Le diable

// L'esclavage
const souratesEsclavage = [2, 2, 4, 4, 4, 4, 5, 8, 8, 8, 8, 8, 16,16, 17, 24, 24, 30, 33, 33, 33, 48, 48, 48, 58, 58, 59, 59, 59, 59, "Le sexe...", 23,23,23, 33,33,33,33, ]
const versetsEsclavage = [178, 221, 24, 25, 36, 92, 89, 1, 41, 69, 70, 71, 75,76, 72, 32, 33, 28, 26, 27, 50, 19, 20, 21, 3, 4, 5, 6, 7, 8, "avec les esclaves est licite!", 5,6,7, 50,51,52,53]
let ahadithsEsclavage = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2565,
    texte: " الوَلَاءَ لِمَن أَعْتَقَ",
    lien: "https://dorar.net/hadith/sharh/12301",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2403,
    texte:
      "أَعْتَقَ رَجُلٌ غُلَامًا له عن دُبُرٍ، فَقالَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ: مَن يَشْتَرِيهِ مِنِّي؟، فَاشْتَرَاهُ نُعَيْمُ بنُ عبدِ اللَّهِ، فأخَذَ ثَمَنَهُ، فَدَفَعَهُ إلَيْهِ",
    lien: "https://dorar.net/hadith/sharh/15197",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1054,
    texte:
      "أمَرَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ بالعَتَاقَةِ في كُسُوفِ الشَّمْسِ.",
    lien: "https://dorar.net/hadith/sharh/13088",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2522,
    texte:
      "مَن أعْتَقَ شِرْكًا له في عَبْدٍ، فَكانَ له مَالٌ يَبْلُغُ ثَمَنَ العَبْدِ قُوِّمَ العَبْدُ عليه قِيمَةَ عَدْلٍ، فأعْطَى شُرَكَاءَهُ حِصَصَهُمْ، وعَتَقَ عليه العَبْدُ، وإلَّا فقَدْ عَتَقَ منه ما عَتَقَ.",
    lien: "https://dorar.net/hadith/sharh/1779",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2539,
    texte: " إمَّا المَالَ وإمَّا السَّبْيَ ",
    lien: "https://dorar.net/hadith/sharh/3449",
    autres: 2540,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2541,
    texte:" فَقَتَلَ مُقَاتِلَتَهُمْ، وسَبَى ذَرَارِيَّهُمْ، وأَصَابَ يَومَئذٍ جُوَيْرِيَةَ",
    lien: "https://dorar.net/hadith/sharh/7139",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2542,
    texte:
      " في غَزْوَةِ بَنِي المُصْطَلِقِ، فأصَبْنَا سَبْيًا مِن سَبْيِ العَرَبِ، فَاشْتَهَيْنَا النِّسَاءَ، واشْتَدَّتْ عَلَيْنَا العُزْبَةُ، وأَحْبَبْنَا العَزْلَ، فأرَدْنَا أنْ نَعْزِلَ، وقُلْنَا: نَعْزِلُ ورَسولُ اللَّهِ صلَّى اللهُ عليه وسلَّمَ بيْنَ أظْهُرِنَا قَبْلَ أنْ نَسْأَلَهُ؟! فَسَأَلْنَاهُ عن ذلكَ، فَقَالَ: ما علَيْكُم أنْ لا تَفْعَلُوا، ما مِن نَسَمَةٍ كَائِنَةٍ إلى يَومِ القِيَامَةِ إلَّا وهي كَائِنَةٌ ",
    lien: "https://dorar.net/hadith/sharh/11750",
  },

  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2545,
    texte:
      "  هُم إخوانُكم خَوَلُكم، جَعَلَهم اللهُ تحت أيْديكم، فمَن كان أخُوه تحت يَدِه فلْيُطعِمْه ممَّا يَأكُلُ، ويُلبِسْه ممَّا يَلبَسُ، ولا تُكلِّفوهم ما يَغلِبُهم، فإنْ كَلَّفتُموهم فأعينُوهم، ومَن لم يُلائِمْكم منهم فبِيعوهم، ولا تُعذِّبوا خَلْقَ اللهِ.",
    lien: "https://dorar.net/hadith/sharh/89125",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2547,
    texte:
      "أَيُّما رَجُلٍ كانَتْ له جارِيَةٌ، فأدَّبَها فأحْسَنَ تَأْدِيبَها، وأَعْتَقَها، وتَزَوَّجَها فَلَهُ أجْرانِ، وأَيُّما عَبْدٍ أدَّى حَقَّ اللَّهِ وحَقَّ مَوالِيهِ فَلَهُ أجْرانِ. ",
    lien: "https://dorar.net/hadith/sharh/7285",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2548,
    texte:
      "لِلْعَبْدِ المَمْلُوكِ الصَّالِحِ أجْرانِ. والذي نَفْسِي بيَدِهِ، لَوْلا الجِهادُ في سَبيلِ اللَّهِ، والحَجُّ، وبِرُّ أُمِّي؛ لَأَحْبَبْتُ أنْ أمُوتَ وأنا مَمْلُوكٌ. ",
    lien: "https://dorar.net/hadith/sharh/118993",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2549,
    texte:
      " نِعْمَ ما لأحَدِهِمْ يُحْسِنُ عِبادَةَ رَبِّهِ ويَنْصَحُ لِسَيِّدِهِ.",
    lien: "https://dorar.net/hadith/sharh/4819",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2552,
    texte: "لا يقولَنَّ أحدُكم عبدي وأمتي ولكن ليقُلْ فتاي وفتاتي ",
    lien: "https://dorar.net/hadith/sharh/110854",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2557,
    texte:
      "إذا أتَى أحَدَكُمْ خادِمُهُ بطَعامِهِ، فإنْ لَمْ يُجْلِسْهُ معهُ، فَليُناوِلْهُ لُقْمَةً أوْ لُقْمَتَيْنِ، أوْ أُكْلَةً أوْ أُكْلَتَيْنِ؛ فإنَّه ولِيَ عِلاجَهُ.",
    lien: "https://dorar.net/hadith/sharh/33060",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2592,
    texte: "أَمَا إنَّكِ لو أَعْطَيْتِهَا أَخْوَالَكِ كانَ أَعْظَمَ لأجْرِكِ.",
    lien: "https://dorar.net/hadith/sharh/16247",
    autres: 2594,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3754,
    texte:
      "كانَ عُمَرُ يقولُ: أبو بَكْرٍ سَيِّدُنَا، وأَعْتَقَ سَيِّدَنَا. يَعْنِي بلَالًا.",
    lien: "https://dorar.net/hadith/sharh/68882",
    autres: 3755,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3804,
    texte:
      "فإنِّي أحْكُمُ فيهم أنْ تُقْتَلَ مُقَاتِلَتُهُمْ وتُسْبَى ذَرَارِيُّهُمْ، قالَ: حَكَمْتَ بحُكْمِ اللَّهِ ",
    lien: "https://dorar.net/hadith/sharh/7125",
    autres: 4122,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6716,
    texte:" مَن يَشْتَرِيهِ مِنِّي؟ فاشْتَراهُ نُعَيْمُ بنُ النَّحَّامِ بثَمانِ مِائَةِ دِرْهَمٍ.",
    lien: "https://dorar.net/hadith/sharh/15197",
  },
];  // Fin Esclavage

// - Juifs Chrtiens Mécréants
const souratesJuifsChretiensMecreants= [2,2,4,4,4,4,4,4,4,4,4,4,4,4,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,6,6,17,18,18,18,18,19,19,19,19,19,21,27,27,45,45];
const versetsJuifsChretiensMecreants = [40,122,46,47,153,154,155,156,157,158,159,160,161,162,12,13,20,21,22,23,24,25,26,27,32,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,146,154,4,4,5,6,88,89,90,91,92,26,76,77,16,17];
const ahadithsJuifsChretiensMecreants = [];// Fin Juifs Chrtiens Mécréants

// Djihad / Violence
const souratesDjihadViolence = [2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 5, 6, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8,9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9,22,24,33,33,33,33,47,47,49,61,61,61,66];
const versetsDjihadViolence = [154, 191, 216, 217, 140, 141, 142, 143, 146, 147, 148, 154, 155, 156, 157, 34, 71, 72, 73, 74, 77, 85, 89, 90, 91, 94, 95, 102, 103, 104, 33, 65, 1, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 39, 43, 44, 45, 57, 58, 60, 65, 66, 67,2, 5, 12, 14, 25, 26, 29, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 73, 74, 81, 82, 83, 88, 93, 111, 123, 78,4,19,20,60,61,4,35,15,4,10,11,9];
const ahadithsDjihadViolence = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 25,
    texte:
      " أُمِرْتُ أنْ أُقَاتِلَ النَّاسَ حتَّى يَشْهَدُوا أنْ لا إلَهَ إلَّا اللَّهُ، وأنَّ مُحَمَّدًا رَسولُ اللَّهِ، ويُقِيمُوا الصَّلَاةَ، ويُؤْتُوا الزَّكَاةَ، فَإِذَا فَعَلُوا ذلكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وأَمْوَالَهُمْ إلَّا بحَقِّ الإسْلَامِ، وحِسَابُهُمْ علَى اللَّهِ.",
    verset: "s9v5",
    lien: "https://dorar.net/hadith/sharh/68099",
    autres: 1399,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 26,
    texte: "أفضَلُ الأعمالِ الإيمانُ باللهِ وَحدَه ، ثمَّ الجهادُ... ",
    lien: "https://dorar.net/hadith/sharh/141857",
    autres: 1519,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 123,
    texte:
      "مَن قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هي العُلْيَا، فَهو في سَبيلِ اللَّهِ عزَّ وجلَّ. ",
    lien: "https://dorar.net/hadith/sharh/8229",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1399,
    texte: "واللَّهِ لَأُقَاتِلَنَّ مَن فَرَّقَ بيْنَ الصَّلَاةِ والزَّكَاةِ ",
    lien: "https://dorar.net/hadith/sharh/67078",
    autres: 1456,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1501,
    texte:
      " فَأُتِيَ بهِمْ، فَقَطَّعَ أيْدِيَهُمْ وأَرْجُلَهُمْ، وسَمَرَ أعْيُنَهُمْ، وتَرَكَهُمْ بالحَرَّةِ يَعَضُّونَ الحِجَارَةَ.",
    lien: "https://dorar.net/hadith/sharh/33629",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 428,
    texte:
      "يا بَنِي النَّجَّارِ ثامِنُونِي بحائِطِكُمْ، قالوا: لا نَطْلُبُ ثَمَنَهُ، إلَّا إلى اللَّهِ. ",
    lien: "https://dorar.net/hadith/sharh/15455",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3995,
    texte:
      " هذا جِبْرِيلُ آخِذٌ برَأْسِ فَرَسِهِ عليه أدَاةُ الحَرْبِ.",
    lien: "https://dorar.net/hadith/sharh/11475",
    autres: 4041,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4037,
    texte: "مَن لِكَعْبِ بنِ الأشْرَفِ؛ فإنَّه قدْ آذَى اللَّهَ ورَسولَهُ؟ ",
    lien: "https://dorar.net/hadith/sharh/4176",
    autres: 2510,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2541,
    texte:
      " إنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّمَ أغَارَ علَى بَنِي المُصْطَلِقِ وهُمْ غَارُّونَ، وأَنْعَامُهُمْ تُسْقَى علَى المَاءِ، فَقَتَلَ مُقَاتِلَتَهُمْ، وسَبَى ذَرَارِيَّهُمْ، وأَصَابَ يَومَئذٍ جُوَيْرِيَةَ.",
    lien: "https://dorar.net/hadith/sharh/7139",
    autres: 3804
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4304,
    texte:
      " والذي نفسُ محمدٍ بيدِه لو أن فاطمةَ بنتَ محمدٍ سَرَقَتْ لقَطَعَتُ يدَها. ",
    lien: "https://dorar.net/hadith/sharh/2028",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2926,
    texte: " لا تَقُومُ السَّاعَةُ حتَّى تُقاتِلُوا اليَهُودَ، حتَّى يَقُولَ الحَجَرُ وراءَهُ اليَهُودِيُّ: يا مُسْلِمُ، هذا يَهُودِيٌّ وَرائي فاقْتُلْهُ.",
    lien: "https://dorar.net/hadith/sharh/15003",
    autres: 3593
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4032,
    texte: " حرَّقَ رسولُ اللَّهِ صلَّى اللَّهُ علَيهِ وسلَّمَ نخلَ بَني النَّضيرِ وقطَّعَ، وَهيَ البوَيْرةُ، فأنزلَ اللَّهُ مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ",
    lien: "https://dorar.net/hadith/sharh/5268",
    autres: 4028
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4039,
    texte: "  بَعَثَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ رَهْطًا مِنَ الأنْصَارِ إلى أبِي رَافِعٍ فَدَخَلَ عليه عبدُ اللَّهِ بنُ عَتِيكٍ بَيْتَهُ لَيْلًا فَقَتَلَهُ وهو نَائِمٌ.",
    lien: "https://dorar.net/hadith/sharh/24040",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4050,
    texte: " أنَّ النبيَّ صَلَّى اللَّهُ عليه وَسَلَّمَ خَرَجَ إلى أُحُدٍ، فَرَجَعَ نَاسٌ مِمَّنْ كانَ معهُ، فَكانَ أَصْحَابُ النبيِّ صَلَّى اللَّهُ عليه وَسَلَّمَ فيهم فِرْقَتَيْنِ، قالَ بَعْضُهُمْ: نَقْتُلُهُمْ، وَقالَ بَعْضُهُمْ: لَا، فَنَزَلَتْ {فَما لَكُمْ في المُنَافِقِينَ فِئَتَيْنِ} [النساء: 88].",
    lien: "https://dorar.net/hadith/sharh/6074",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2664,
    texte: "  أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ: عَرَضَهُ يَومَ أُحُدٍ وهو ابنُ أرْبَعَ عَشْرَةَ سَنَةً، فَلَمْ يُجِزْهُ، وعَرَضَهُ يَومَ الخَنْدَقِ، وهو ابنُ خَمْسَ عَشْرَةَ سَنَةً، فأجَازَهُ.",
    lien: "https://dorar.net/hadith/sharh/25633",
    autres: 4097
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2813,
    texte: "لَمَّا رَجَعَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ مِنَ الخَنْدَقِ، ووَضَعَ السِّلَاحَ واغْتَسَلَ، أتَاهُ جِبْرِيلُ عليه السَّلَامُ، فَقالَ: قدْ وضَعْتَ السِّلَاحَ؟ واللَّهِ ما وضَعْنَاهُ، فَاخْرُجْ إليهِم قالَ: فَإِلَى أيْنَ؟ قالَ: هَا هُنَا، وأَشَارَ إلى بَنِي قُرَيْظَةَ، فَخَرَجَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إليهِم ",
    lien: "https://dorar.net/hadith/sharh/21196",
    autres: 4117
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4123,
    texte: "قَالَ رَسولُ اللَّهِ صلَّى اللهُ عليه وسلَّمَ يَومَ قُرَيْظَةَ لِحَسَّانَ بنِ ثَابِتٍ: اهْجُ المُشْرِكِينَ؛ فإنَّ جِبْرِيلَ معكَ. ",
    lien: "https://dorar.net/hadith/sharh/14401",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4138,
    texte: " خَرَجْنَا مع رَسولِ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ في غَزْوَةِ بَنِي المُصْطَلِقِ، فأصَبْنَا سَبْيًا مِن سَبْيِ العَرَبِ، فَاشْتَهَيْنَا النِّسَاءَ، فَاشْتَدَّتْ عَلَيْنَا العُزْبَةُ، وأَحْبَبْنَا العَزْلَ، فَسَأَلْنَا رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ، فَقالَ: ما علَيْكُم أنْ لا تَفْعَلُوا ما مِن نَسَمَةٍ كَائِنَةٍ إلى يَومِ القِيَامَةِ إلَّا وهي كَائِنَةٌ.",
    lien: "https://dorar.net/hadith/sharh/11750",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4192,
    texte: " ... فأمرَ بِهِم فقُطِعَت أيديهم وأرجلُهُم وسمرَ أعينُهُم ، وألقَوا في الحرَّةِ يستَسقونَ فلا يُسقونَ",
    lien: "https://dorar.net/hadith/sharh/10926",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4197 ,
    texte: " أنَّ رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ أتَى خَيْبَرَ لَيْلًا، وكانَ إذا أتَى قَوْمًا بلَيْلٍ لَمْ يُغِرْ بهِمْ حتَّى يُصْبِحَ، فَلَمَّا أصْبَحَ خَرَجَتِ اليَهُودُ بمَساحِيهِمْ، ومَكاتِلِهِمْ فَلَمَّا رَأَوْهُ قالوا: مُحَمَّدٌ واللَّهِ، مُحَمَّدٌ والخَمِيسُ، فقالَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ: خَرِبَتْ خَيْبَرُ، إنَّا إذا نَزَلْنا بساحَةِ قَوْمٍ {فَساءَ صَباحُ المُنْذَرِينَ} [الصافات: 177]",
    lien: "https://dorar.net/hadith/sharh/24120",
    autres: "371, 4200, 4201, 4211, 4213"
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero:4286 ,
    texte: " عن أنسِ بنِ مالكٍ, أنَّ رسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم دخل مكةَ عامَ الفتحِ, وعلى رأسِه المغفَرُ, فلما نزعَه, جاءَه رجلٌ فقال : ابنُ خطلٍ متعلِّقٌ بأستارِ الكعبةِ, فقال ( رسولُ اللهِ صلَّى اللهُ عليهِ وسلَّم ) اقتلوهُ",
    lien: "https://dorar.net/hadith/sharh/79443",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4274,
    texte: " فَقالَ عُمَرُ: يا رَسولَ اللَّهِ، دَعْنِي أضْرِبْ عُنُقَ هذا المُنَافِقِ، فَقالَ: إنَّه قدْ شَهِدَ بَدْرًا، وما يُدْرِيكَ لَعَلَّ اللَّهَ اطَّلَعَ علَى مَن شَهِدَ بَدْرًا، فَقالَ: اعْمَلُوا ما شِئْتُمْ؛ فقَدْ غَفَرْتُ لَكُمْ. فأنْزَلَ اللَّهُ السُّورَةَ: {يَاأَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَقَدْ كَفَرُوا بِمَا جَاءَكُمْ مِنَ الْحَقِّ} إلى قَوْلِهِ: {فقَدْ ضَلَّ سَوَاءَ السَّبِيلِ} [الممتحنة: 1]",
    lien: "https://dorar.net/hadith/sharh/117689",
    autres: 2494
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4304,
    texte: "والذي نَفْسُ مُحَمَّدٍ بيَدِهِ، لو أنَّ فاطِمَةَ بنْتَ مُحَمَّدٍ سَرَقَتْ، لَقَطَعْتُ يَدَها. ثُمَّ أمَرَ رَسولُ اللَّهِ صلَّى اللهُ عليه وسلَّمَ بتِلْكَ المَرْأَةِ، فَقُطِعَتْ يَدُها، فَحَسُنَتْ تَوْبَتُها بَعْدَ ذلكَ وتَزَوَّجَتْ. قالَتْ عائِشَةُ: فَكانَتْ تَأْتي بَعْدَ ذلكَ فأرْفَعُ حاجَتَها إلى رَسولِ اللَّهِ صلَّى اللهُ عليه وسلَّمَ. ",
    lien: "https://dorar.net/hadith/sharh/82722",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4339,
    texte: " اللَّهُمَّ إنِّي أبْرَأُ إلَيْكَ ممَّا صَنَعَ خَالِدُ بنُ الوَلِيدِ مَرَّتَيْنِ.",
    lien: "https://dorar.net/hadith/sharh/24160",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3949,
    texte: " كنتُ إلى جنبِ زيدِ بنِ أرقمَ فقيلَ لهُ : كم غزا النَّبيُّ صلَّى اللَّهُ عليهِ وسلَّمَ من غزوةٍ قالَ : تسعَ عشرةَ فقلتُ : كم غزوتَ أنتَ معهُ ؟قالَ : سبعَ عشرةَ ، قلتُ : وأيَّتُهنَّ كانَ أوَّلَ ؟ قالَ : ذاتُ العُشَيراءِ – أو العُسَيراءِ -",
    lien: "https://dorar.net/hadith/sharh/12021",
    autres: 4471
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1884,
    texte: " رَجَعَ نَاسٌ مِن أصْحَابِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ مِن أُحُدٍ، وكانَ النَّاسُ فيهم فِرْقَتَيْنِ: فَرِيقٌ يقولُ: اقْتُلْهُمْ، وفَرِيقٌ يقولُ: لَا، فَنَزَلَتْ: {فَما لَكُمْ في المُنَافِقِينَ فِئَتَيْنِ}",
    lien: "https://dorar.net/hadith/sharh/6072",
    autres: 4589
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4592,
    texte: "لَا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ} {وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ} [النساء: 95] ",
    lien: "https://dorar.net/hadith/sharh/3173",
    autres: 4990
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3377,
    texte: "  لا يضربُ أحدُكم امرأتَه ضربَ الأمةِ ثم يضاجعُها",
    lien: "https://dorar.net/hadith/sharh/138072",
    autres: 5204
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5295,
    texte: " أنَّ يَهُودِيًّا قَتَلَ جَارِيَةً علَى أوْضَاحٍ لَهَا، فَقَتَلَهَا بحَجَرٍ، فَجِيءَ بهَا إلى النبيِّ صَلَّى اللهُ عليه وسلَّمَ وبِهَا رَمَقٌ، فَقالَ: أقَتَلَكِ فُلَانٌ؟ فأشَارَتْ برَأْسِهَا: أنْ لَا، ثُمَّ قالَ الثَّانِيَةَ، فأشَارَتْ برَأْسِهَا: أنْ لَا، ثُمَّ سَأَلَهَا الثَّالِثَةَ، فأشَارَتْ برَأْسِهَا: أنْ نَعَمْ، فَقَتَلَهُ النبيُّ صَلَّى اللهُ عليه وسلَّمَ بحَجَرَيْنِ.",
    lien: "https://dorar.net/hadith/sharh/8019",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5357,
    texte: " كان يبيعُ نخلَ بني النضيرِ ، ويحبِسُ لأهْلِهِ قوتَ سنتِهم",
    lien: "https://dorar.net/hadith/sharh/24736",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6777,
    texte: " أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ ضَرَبَ في الخَمْرِ بالجَرِيدِ والنِّعالِ، وجَلَدَ أبو بَكْرٍ أرْبَعِينَ.",
    lien: "https://dorar.net/hadith/sharh/11762",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6789,
    texte: " لَا تُقْطَعُ يَدُ السَّارِقِ إلَّا في رُبْعِ دِينَارٍ فَصَاعِدًا.",
    lien: "https://dorar.net/hadith/sharh/4920",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6812,
    texte: " عَنْ عَلِيٍّ رَضِيَ اللَّهُ عنْه حِينَ رَجَمَ المَرْأَةَ يَومَ الجُمُعَةِ، وقالَ: قدْ رَجَمْتُهَا بسُنَّةِ رَسولِ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ.",
    lien: "https://dorar.net/hadith/sharh/67065",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6840,
    texte: " رَجَمَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ فَقُلتُ: أقَبْلَ النُّورِ أمْ بَعْدَهُ؟ قالَ: لا أدْرِي.",
    lien: "https://dorar.net/hadith/sharh/11551",
  }
];// Fin Djihad / Violence

//- Insultes et moqueries
const souratesInsultesMoqueries = [1,2,2,2,5,5,7,7,7,9,9,9,10,10,25,31,39,54,54,62,68,68,111,111,111,111,111];
const versetsInsultesMoqueries = [7,18,65,171,60,64,166,176,179,28,29,95,26,43,44,19,64,7,31,5,13,16,1,2,3,4,5];
const ahadithsInsultesMoqueries = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 691,
    texte:
      " أما يخشى الَّذي يرفَعُ رأسَهُ قبلَ الإمامِ راكعًا أو ساجدًا أن يحوِّلَ اللَّهُ رأسَهُ رأسَ حمارٍ أو صورتَهُ صورةَ حمارٍ",
    lien: "https://dorar.net/hadith/sharh/72198",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 797,
    texte: "فيدعو للمؤمنينَ ويلعنُ الْكافرينَ",
    lien: "https://dorar.net/hadith/sharh/36802",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3453,
    texte:
      "لَعْنَةُ اللَّهِ علَى اليَهُودِ والنَّصارَى؛ اتَّخَذُوا قُبُورَ أنْبِيائِهِمْ مَساجِدَ. يُحَذِّرُ ما صَنَعُوا.",
    lien: "https://dorar.net/hadith/sharh/347",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1358,
    texte:
      "كُلُّ مَوْلُودٍ يُولَدُ علَى الفِطْرَةِ، فأبَوَاهُ يُهَوِّدَانِهِ، أوْ يُنَصِّرَانِهِ، أوْ يُمَجِّسَانِهِ، كَمَثَلِ البَهِيمَةِ تُنْتَجُ البَهِيمَةَ هلْ تَرَى فِيهَا جَدْعَاءَ.",
    lien: "https://dorar.net/hadith/sharh/11465",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1394,
    texte:
      "قالَ أبو لَهَبٍ عليه لَعْنَةُ اللَّهِ للنبيِّ صَلَّى اللهُ عليه وسلَّمَ: تَبًّا لكَ سَائِرَ اليَومِ فَنَزَلَتْ: {تَبَّتْ يَدَا أبِي لَهَبٍ وتَبَّ} [المسد: 1]",
    lien: "https://dorar.net/hadith/sharh/4292",
    autres: "4770, 4801",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3330,
    texte:
      " لَوْلَا بَنُو إِسْرَائِيلَ، لَمْ يَخْبُثِ الطَّعَامُ، وَلَمْ يَخْنَزِ اللَّحْمُ، وَلَوْلَا حَوَّاءُ لَمْ تَخُنْ أُنْثَى زَوْجَهَا الدَّهْرَ.",
    lien: "https://dorar.net/hadith/sharh/22158",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3462,
    texte: "إنَّ اليَهُودَ وَالنَّصَارَى لا يَصْبُغُونَ، فَخَالِفُوهُمْ.",
    lien: "https://dorar.net/hadith/sharh/34253",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4475,
    texte:
      "إذا قالَ الإمامُ: {غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ} [الفاتحة: 7] فَقُولوا آمِينَ، فمَن وافَقَ قَوْلُهُ قَوْلَ المَلائِكَةِ غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ",
    lien: "https://dorar.net/hadith/sharh/11383",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5395,
    texte:
      "إنَّ الكَافِرَ يَأْكُلُ في سَبْعَةِ أمْعَاءٍ فَقالَ: فأنَا أُومِنُ باللَّهِ ورَسولِهِ. ",
    lien: "https://dorar.net/hadith/sharh/5157",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5885,
    texte:
      "لعن اللهُ المتشبهين بالنساءِ من الرجالِ والمتشبهاتِ من النساءِ بالرجالِ. ",
    lien: "https://dorar.net/hadith/sharh/80461",
  },
];//-  fIN Insultes et moqueries

//- H E R I T A G E
const souratesHeritage = [2,2,2,      4,4,4,4,4,4,4,4,        5,5,5,      8,  33,  89,89 ];
const versetsHeritage = [180,181,182, 7,8,9,11,12,19,33,176, 106,107,108, 75, 6,   18,19];
const ahadithsHeritage = [
  
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4240,
    texte:" .  إنَّما يأكُلُ آلُ محمَّدٍ مِن هذا المالِ ليس لهم أنْ يزيدوا على المأكَلِ وإنِّي واللهِ لا أُغيِّرُ شيئًا مِن صدقاتِ رسولِ اللهِ لا نُورَثُ ما ترَكْناه صدقةٌ ",
    lien: "https://dorar.net/hadith/sharh/290",
    autres: "4035"
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6764,
    texte:" لا يرِثُ المُسلِمُ الكافرَ ولا الكافرُ المُسلِمَ",
    lien: "https://dorar.net/hadith/sharh/128959",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3936,
    texte:" الثلثُ والثلثُ كثيرٌ أو كبيرٌ",
    lien: "https://dorar.net/hadith/sharh/67035",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6737,
    texte:" ألحِقوا الفرائضَ بأصحابِها، فما أبقَت الفرائضُ فلأَولَى رجُلٍ ذَكَرٍ",
    lien: "https://dorar.net/hadith/sharh/85399",
    autres: "6732"
  },
  
];//- fin H E R I T A G E 

//- P F f  f f f  f  f
const souratesPfffff = [2,2,    5,5,5,5,        6,6,     7,7,7,       10,10,10,10, 16,17,18,20,22, 24,24,24,24,24,24, 25,25, 27,27,27, 33,33, 35, 36,36,36,36, 39,39,39,39, 40,40,40, 43,48, 49,49,50,55,59,97,103];
const versetsPfffff = [137,189, 67,106,107,108, 59,142, 145,148,154, 28,29,30,94, 80,64,25,71,18, 27,35,28,29,58,60, 24,47, 18,82,86, 56,72, 41, 71,72,73,80, 10,13,15,45, 67,79,80, 45,17, 4,5, 30,6,21,97,103];
const ahadithsPfffff = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 144,
    texte:
      "إِذَا أتَى أحَدُكُمُ الغَائِطَ، فلا يَسْتَقْبِلِ القِبْلَةَ ولَا يُوَلِّهَا ظَهْرَهُ، شَرِّقُوا أوْ غَرِّبُوا. ",
    lien: "https://dorar.net/hadith/sharh/22725",
  },

  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 153,
    texte:
      " لا يُمْسِكَنَّ أحَدُكُمْ ذَكَرَهُ بيَمِينِهِ وهو يَبُولُ، ولا يَتَمَسَّحْ مِنَ الخَلاءِ بيَمِينِهِ، ولا يَتَنَفَّسْ في الإناءِ.",
    lien: "https://dorar.net/hadith/sharh/17634",
  },

  {
    auteur: "Muslim صحيح مسلم",
    numero: 280,
    texte:" إذا ولغَ الكلبُ في الإناءِ فاغسِلوهُ سبعَ مرَّاتٍ وعفِّروهُ الثَّامنةَ بالتُّرابِ",
    lien: "https://dorar.net/hadith/sharh/32134",
  },

  {
    auteur: "El Boukhari صحيح البخاري",
    numero:218 ,
    texte:"  أمَّا أحدُهما فكان يسعى بالنَّميمةِ وأمَّا الآخَرُ فكان لا يستنزِهُ مِن بولِه إنَّهما ليُعذَّبانِ وما يُعذَّبانِ في كبيرٍ",
    lien: "https://dorar.net/hadith/sharh/12463",
    autres: "1361, 1378 "
  },

  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 416,
    texte:" إن أحدَكم إذا قام في صلاتِه فإنه يُناجي ربَّه ، و إنَّ ربَّه بينَه و بين القبلةِ ، فلا يبزُقنَّ أحدُكم قِبَلَ قبلتِه ، و لكن عن يسارِه أو تحتَ قدمِه",
    lien: "https://dorar.net/hadith/sharh/114172",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 418,
    texte:" أترونَ قِبلتي هاهُنا؟ فواللَّهِ ما يخفى عليَّ خشوعُكُم ولا رُكوعُكُم إنِّي لأراكم من وراءِ ظَهْري",
    lien: "https://dorar.net/hadith/sharh/112163",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero:1114 ,
    texte:" ذَاكَ رَجُلٌ بَالَ الشَّيْطَانُ في أُذُنَيْهِ، أَوْ قالَ: في أُذُنِهِ.",
    lien: "https://dorar.net/hadith/sharh/9598",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3292,
    texte:"الرؤيَا الصالحةُ من اللهِ ، والحلمُ من الشيطانِ ، فإذا حلمَ أحدكم حلما يخافهُ ، فليبصقْ عن يسارهِ ثلاثَ مراتٍ ، وليستعذْ باللهِ من شرهِ ، فإنه لا يضرهُ ",
    lien: "https://dorar.net/hadith/sharh/121916",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3297,
    texte:" اقْتُلُوا الحَيّاتِ، واقْتُلُوا ذا الطُّفْيَتَيْنِ والأبْتَرَ، فإنَّهُما يَطْمِسانِ البَصَرَ، ويَسْتَسْقِطانِ الحَبَلَ.",
    lien: "https://dorar.net/hadith/sharh/12143",
    autres: "3310"
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3306,
    texte:" أمَر رسولُ اللهِ صلَّى اللهُ عليه وسلَّم بقتلِ الوَزَغِ وسمَّاه فُوَيْسِقًا",
    lien: "https://dorar.net/hadith/sharh/16054",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3314,
    texte:" خمسُ فواسِقَ يُقتَلْنَ في الحِلِّ والحَرَمِ الفأرةُ والعَقْرَبُ والحِدَأَةُ والكَلبُ العَقورُ والغُرَابُ",
    lien: "https://dorar.net/hadith/sharh/124358",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero:3320 ,
    texte:"إذا وقَعَ الذُّبابُ في إناءِ أحَدِكم فامقُلُوه؛ فإنَّ في أحَدِ جَناحَيه داءً، وفي الآخَرِ شِفاءً، وإنَّه يتَّقي بجَناحِه الذي فيه الدَّاءُ، فلْيَغمِسْه كُلَّه ",
    lien: "https://dorar.net/hadith/sharh/117405",
  },
  {
    auteur: "Muslim صحيح مسلم",
    numero: 1572,
    texte:"أمرَ نبيُّ اللَّهِ صلَّى اللَّهُ عليْهِ وسلَّمَ بقتلِ الْكلابِ . حتَّى إن كانتِ المرأةُ تقدُمُ منَ الباديةِ يعني بالْكلبِ فنقتلُهُ ثمَّ نَهانا عن قتلِها وقالَ عليْكم بالأسوَدِ",
    lien: "https://dorar.net/hadith/sharh/37032",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6227,
    texte:" خلَق اللهُ آدَمَ على صورتِه وطولُه سِتُّونَ ذراعًا",
    lien: "https://dorar.net/hadith/sharh/12845",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3938,
    texte:" إنِّي سَائِلُكَ عن ثَلَاثٍ لا يَعْلَمُهُنَّ إلَّا نَبِيٌّ",
    lien: "https://dorar.net/hadith/sharh/14507",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero:6223,
    texte:"إنَّ اللهَ يُحِبُّ العُطاسَ ويكرَهُ التَّثاؤبَ فإذا تثاءَب أحدُكم فليكظِمْ ما استطاع أو ليضَعْ يدَه على فيه فإنَّه إذا تثاءَب فقال: آه فإنَّما هو الشَّيطانُ يضحَكُ مِن جوفِه ",
    lien: "https://dorar.net/hadith/sharh/15100",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3295,
    texte:" إذا استيقظ أحدُكم من منامِه فتوضَّأَ فلْيَسْتَنْثِرْ ثلاثَ مراتٍ ، فإنَّ الشيطانَ يبِيتُ على خياشيمِه",
    lien: "https://dorar.net/hadith/sharh/3551",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3303,
    texte:"إذا سمعتُم صِياحَ الدِّيكةِ فسَلُوا الله تعالى من فَضْلِه؛ فإنَّها رأت مَلَكًا، وإذا سمعتُم نهيقَ الحِمارِ فتعَوَّذوا بالله من الشَّيطانِ؛ فإنَّها رأت شيطانًا ",
    lien: "https://dorar.net/hadith/sharh/10511",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero:6227 ,
    texte:" فكُلُّ مَن يَدخلُ الجنةَ على صورةِ آدمَ في طُولِه سِتُّونَ ذِراعًا ، فلمْ تَزلْ الخَلْقُ تَنقُصُ بعدَه حتى الآنَ",
    lien: "https://dorar.net/hadith/sharh/12844",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3356,
    texte:"اخْتَتَنَ إِبْرَاهِيمُ النبيُّ عليه السَّلَامُ، وَهو ابنُ ثَمَانِينَ سَنَةً بالقَدُومِ. ",
    lien: "https://dorar.net/hadith/sharh/16636",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3849,
    texte:" رَأَيْتُ في الجَاهِلِيَّةِ قِرْدَةً اجْتَمع عَلَيْهَا قِرَدَةٌ، قدْ زَنَتْ، فَرَجَمُوهَا، فَرَجَمْتُهَا معهُمْ.",
    lien: "https://dorar.net/hadith/sharh/150656",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4512,
    texte:" كَانُوا إذَا أحْرَمُوا في الجَاهِلِيَّةِ أتَوْا البَيْتَ مِن ظَهْرِهِ فأنْزَلَ اللَّهُ: {وَليسَ البِرُّ بأَنْ تَأْتُوا البُيُوتَ مِن ظُهُورِهَا ولَكِنَّ البِرَّ مَنِ اتَّقَى وأْتُوا البُيُوتَ مِن أبْوَابِهَا}",
    lien: "https://dorar.net/hadith/sharh/3083",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero:6542 ,
    texte:"يَدْخُلُ الجَنَّةَ مِن أُمَّتي زُمْرَةٌ هُمْ سَبْعُونَ ألْفًا، تُضِيءُ وُجُوهُهُمْ إضاءَةَ القَمَرِ لَيْلَةَ البَدْرِ ",
    lien: "https://dorar.net/hadith/sharh/26256",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6249,
    texte:"يا عائِشَةُ هذا جِبْرِيلُ يَقْرَأُ عَلَيْكِ السَّلامَ قالَتْ: قُلتُ: وعليه السَّلامُ ورَحْمَةُ اللَّهِ، تَرَى ما لا نَرَى ",
    lien: "https://dorar.net/hadith/sharh/4741",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5197,
    texte:"رأيتُ الجنةَ فتناولتُ منها عُنقودًا ولو أخذتُه لأكلتُم منه ما بَقِيَتِ الدنيا",
    lien: "https://dorar.net/hadith/sharh/67314",
  },

];//- fIN P F f  f f f  f  f

//- Miracles scientifiques
const souratesMiraclesScientifiques = ["Jésus et ...", 3,3,3,3,3,3,3,3, 5,5,5,5,5,5,5,5, 19,19,19,19,                       "Jonas et ...",37,37,37,37,37,37,37,37,37,   "La Terre et ...", 21, "Le toit et ...",21,21,21,22,27,        `L'embriologie...`, 23,23,23,             "Les djinns...", 55, "La lune est ...", 54, "Le voyage...", 17, "Les deux...", 55,55,55, ];
const versetsMiraclesScientifiques = ["les miracles", 45,46,47,48,49,54,55,59, 110,111,112,113,114,115,116,117, 28,29,30,31, "le poisson", 139,140,141,142,143,144,145,146,147,  "le big bang", 30,     "les piliers",31,32,33,65,61,   `l'Homme est créé ...d'argile!`, 12,13,14,"de feu", 15,        "brisée!", 1,          "nocturne", 1,      "mers...", 19,20,22,];
const ahadithsMiraclesScientifiques = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3637,
    texte:
      "أنَّ أَهْلَ مَكَّةَ سَأَلُوا رَسُولَ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ أَنْ يُرِيَهُمْ آيَةً فأرَاهُمُ انْشِقَاقَ القَمَرِ مَرَّتَيْنِ.",
    lien: "https://dorar.net/hadith/sharh/7746",
    lien2: "https://dorar.net/hadith/sharh/76795",
    lien3: "https://dorar.net/hadith/sharh/7744",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3887,
    texte: "رِحلةُ الإسْراءِ والمِعْراجِ",
    lien: "https://dorar.net/hadith/sharh/151389",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3888,
    texte: "شَجرةُ الزَّقُّومِ",
    lien: "https://dorar.net/hadith/sharh/14047",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4210,
    texte:
      "فَبَصَقَ رَسولُ اللَّهِ صلَّى اللهُ عليه وسلَّمَ في عَيْنَيْهِ ودَعَا له",
    lien: "https://dorar.net/hadith/sharh/72767",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4478,
    texte: "الْكَمْأَةُ مِنَ المَنِّ، وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ.",
    lien: "https://dorar.net/hadith/sharh/14881",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4622,
    texte:
      "يَا أَيُّهَا الَّذِينَ آَمَنُوا لَا تَسْأَلُوا عَنْ أَشْيَاءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ",
    lien: "https://dorar.net/hadith/sharh/81685",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4649,
    texte: "قالَ أبو جَهْلٍ: اللَّهُمَّ إنْ كانَ هذا هو الحَقَّ مِن عِندِكَ فأمْطِرْ عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ، أوِ ائْتِنَا بعَذَابٍ ألِيمٍ، فَنَزَلَتْ: {وَما كانَ اللَّهُ لِيُعَذِّبَهُمْ وأَنْتَ فيهم، وما كانَ اللَّهُ مُعَذِّبَهُمْ وهُمْ يَسْتَغْفِرُونَ، وما لهمْ أنْ لا يُعَذِّبَهُمُ اللَّهُ وهُمْ يَصُدُّونَ عَنِ المَسْجِدِ الحَرَامِ} الآيَةَ.",
    lien: "https://dorar.net/hadith/sharh/24772",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 7379,
    texte: "مفاتيحُ الغيبِ خَمْسٌ لا يعلَمُها إلَّا اللهُ : لا يعلَمُ ما تغيضُ الأرحامَ أحَدٌ إلَّا اللهُ ولا ما في غَدٍ إلَّا اللهُ ولا يعلَمُ متى يأتي المطَرُ إلَّا اللهُ ولا تدري نفسٌ بأيِّ أرضٍ تموتُ ولا يعلَمُ متى تقومُ السَّاعةُ أحَدٌ إلَّا اللهُ",
    lien: "https://dorar.net/hadith/sharh/12789",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4802,
    texte: "كُنْتُ مع النبيِّ صَلَّى اللهُ عليه وسلَّمَ في المَسْجِدِ عِنْدَ غُرُوبِ الشَّمْسِ، فَقالَ: يا أبَا ذَرٍّ أتَدْرِي أيْنَ تَغْرُبُ الشَّمْسُ؟ قُلتُ: اللَّهُ ورَسولُهُ أعْلَمُ، قالَ: فإنَّهَا تَذْهَبُ حتَّى تَسْجُدَ تَحْتَ العَرْشِ، فَذلكَ قَوْلُهُ تَعَالَى: {وَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَهَا ذلكَ تَقْدِيرُ العَزِيزِ العَلِيمِ}.",
    lien: "https://dorar.net/hadith/sharh/6677",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5445,
    texte: "مَن تَصَبَّحَ بسَبْعِ تَمَراتٍ عَجْوَةً، لَمْ يَضُرَّهُ ذلكَ اليومَ سُمٌّ، ولا سِحْرٌ.",
    lien: "https://dorar.net/hadith/sharh/20979",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5687,
    texte: "الحَبَّةُ السَّوْدَاءُ شِفَاءٌ من كلِّ دَاءٍ إلَّا السَّامَ",
    lien: "https://dorar.net/hadith/sharh/79430",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5741,
    texte: "رخَّصَ رسولُ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ في الرُّقيةِ، مِن كلِّ ذي حُمَةٍ",
    lien: "https://dorar.net/hadith/sharh/88016",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3320,
    texte: "إذا وقَعَ الذُّبابُ في إناءِ أحَدِكم فامقُلُوه؛ فإنَّ في أحَدِ جَناحَيه داءً، وفي الآخَرِ شِفاءً، وإنَّه يتَّقي بجَناحِه الذي فيه الدَّاءُ، فلْيَغمِسْه كُلَّه",
    lien: "https://dorar.net/hadith/sharh/117405",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3208,
    texte: "إنَّ أحدَكم يُجْمَعُ خَلْقُهُ في بطنِ أمِّه أربعينَ يومًا نطفةً ، ثم يكونُ علقةً مثلَ ذلك ، ثم يكونُ مضغةً مثلَ ذلك ، ثم يبعثُ اللهُ إليه ملَكا ، ويُؤمرُ بأربعِ كلماتٍ ، ويُقالُ له : اكتبْ عملَه ، ورزقَه ، وأجلَه ، وشقيٌّ أو سعيدٌ ؛ ثم يُنفخُ فيه الروحَ",
    lien: "https://dorar.net/hadith/sharh/4724",
    autres: "",
  },
  
];//- fin Miracles scientifiques

//- Création de l'Univers
const souratesCreationUnivers = [
  "Création de … ", 2,7,10,11,14,15,15,15,17,17,25,25,37,37,37,88,88,40,41,50,50,41,64,65,67 ,79,79,
  "création de … ",4,6,6,7,15,15,15,15,16,16,18,22,22,30,32,32,32,38,39,53,55,78,80,80,80,86,86,95,
  "Création des … ", 15, 55,
  "Création des … ", 24, 88,
  "Création de … ",7,15,15,51,53,
];
const versetsCreationUnivers = [
  " la Terre et de 7 cieux! ", 29, 54, 3, 7, 33, 16, 19, 20, 12, 44, 59, 61, 4, 5, 6, 18, 19, 64, 9, 6, 7, 12, 3, 12, 3, 27, 28,
" l’Homme" ,1,2,98,189,26,28,29,33,4,72,37,66,54,20,7,8,9,71,6,46,14,8,17,18,19,6,7,4,
"anges et diables ! ",27,15,
"animaux", 45,17,
"tout ! " ,57,21,22,49,45,

];
const ahadithsCreationUnivers = [
  {
    auteur: "El Boukhari  صحيح  البخاري" ,
    numero: 1901,
    texte: "مَن صَامَ رَمَضَانَ إيمَانًا واحْتِسَابًا غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ",
    lien: "https://dorar.net/hadith/sharh/10254",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
];// fin création

//- Forme de la terre
const souratesFormeTerre = [18,20,31,39,40,41,41,43,51,57,78,78,79,79,88];
const versetsFormeTerre = [86,53,29,5,64,10,11,10,48,4,6,7,30,32,20];
const ahadithsFormeTerre = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
];//- Fin Forme de la terre


// Les noms des sourates
const souratesNomsSourates = [17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114];
const versetsNomsSourates = [1,9,1,1,1,1,1,1,1,224,1,1,41,1,12,1,33,1,1,1,165,1,1,3,3,38,35,1,28,1,1,1,4,1,1,1,1,1,1,1,1,1,2,1,4,9,1,9,1,1,1,1,1,3,1,1,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1,7,1,1,1,1,1,1,1];
const ahadithsNomsSourates = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
]; //fin noms des sourates

// Abrogation
const souratesAbrogation = [
 
 "Versets en lien avec ... ", 2, 13, 16, 22, 22,
  "Exemples de versets... ",
  
  "1. ",
  "Tolérance implicite ", 16,
  "Le mal est supérieur au bien", 2,
  "Interdiction partielle", 4,
  "Interdiction diffinitive", 5, 5,
  "Autres versets lié à l'alcool", 47,83,83,

];
const versetsAbrogation = [
  
  "l'abrogation", 106, 39, 101, 52, 53,
  "abrogeants et abrogés",

  "L'alcool",
  "(période mecquoise)", 67,
  "(période intermédiaire - médine)", 219,
  "pendant la prière", 43,
  "Selon l'interprétation majoritaire", 90, 91,
  "(le vin au paradis)", 15,25,26,

  
];
const ahadithsAbrogation = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
];


// La volonté d'Allah
const souratesVolonteAllah = [2,2,2,2,2,2,2,2,2,2,2,            3,3,3,3,      4,4,4,4,     6,6,6,6,6,6,6,6,6,6,6,                   7,7,     9,9,9,      10,10,10,  11, 13,13, 14,14, 15, 16,16,16,16,16,16,16,16, 17,  18,18, 22, 25, 28, 35,35, 36, 42, 43, 45, 47, 63,63, 76,76, 81];
const versetsVolonteAllah = [6,7,8,9,10,26,142,213,253,272,284, 26,27,47,129, 48,49,52,88, 25,35,39,41,110,111,112,123,125,137,149, 100,186, 87,117,127, 74,99,100, 118, 27,31, 4,27, 12, 9,36,37,38,39,93,107,108, 46, 17,57, 16, 31, 56, 8,9,   10, 8,  36, 23, 23, 3,6,   30,31, 29];
const ahadithsVolonteAllah = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
]; // Fin volonté d'Allah

// La Faune et la Flore
const souratesFauneFlore = [2,2, 7, 16,16,16, 18,18, 23,23, 27,27, 38,38, 44, 55, 56, 74, 80, 88, 95, 105];
const versetsFauneFlore = [67,259, 176, 8,11,14, 18,32, 19,20, 18,20, 23,31, 43, 11, 23, 51, 28, 17, 1, 1,];
const ahadithsFauneFlore = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
]; // Fin Faune et Flore

// Mariage & Divorce
const souratesMariageDivorce = [2,2,2,2,2, 4,4,4,4, 24,24, 33, 65,65,65,65,65];
const versetsMariageDivorce = [221,228,229,230,234, 22,23,24,25, 3,26, 49, 2,3,4,5,6];
const ahadithsMariageDivorce = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2639,
    texte:
      "أتريدينَ أن ترجِعي إلى رفاعةَ لا حتَّى تذوقي عُسَيلتَهُ ويذوقَ عُسَيلتَكِ",
    lien: "https://dorar.net/hadith/sharh/112150",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2494,
    texte:
      "أنَّ رَجُلًا كَانَتْ له يَتِيمَةٌ فَنَكَحَهَا، وكانَ لَهَا عَذْقٌ، وكانَ يُمْسِكُهَا عليه، ولَمْ يَكُنْ لَهَا مِن نَفْسِهِ شيءٌ فَنَزَلَتْ فِيهِ: {وَإنْ خِفْتُمْ أنْ لا تُقْسِطُوا في اليَتَامَى} أحْسِبُهُ قالَ: كَانَتْ شَرِيكَتَهُ في ذلكَ العَذْقِ وفي مَالِهِ",
    lien: "https://dorar.net/hadith/sharh/43494",
    autres: "dorar 735",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5113,
    texte:
      " أما تستَحي المرأةُ أن تَهَبَ نفسَها للنَّبيِّ صلَّى اللَّهُ علَيهِ وسلَّمَ؟ حتَّى أنزلَ اللَّهُ: تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ قالَت : فقلتُ إنَّ ربَّكَ ليسارِعُ في هواكَ",
    lien: "https://dorar.net/hadith/sharh/41605",
    autres: "4788",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5065,
    texte:
      "يَا مَعْشَرَ الشَّبَابِ، مَنِ اسْتَطَاعَ مِنْكُمُ البَاءَةَ فَلْيَتَزَوَّجْ، فإنَّه أَغَضُّ لِلْبَصَرِ، وَأَحْصَنُ لِلْفَرْجِ، وَمَن لَمْ يَسْتَطِعْ فَعليه بالصَّوْمِ، فإنَّه له وِجَاءٌ.",
    lien: "https://dorar.net/hadith/sharh/13863",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5136,
    texte:
      "لا تُنكحُ الثيِّبُ حتى تُستأمرَ ، و لا تُنكحُ البكرُ حتى تُستأذنَ ، و إذْنُها الصموتُ",
    lien: "https://dorar.net/hadith/sharh/70482",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5213,
    texte:
      " السُّنَّةُ إذا تَزَوَّجَ البِكْرَ أقامَ عِنْدَها سَبْعًا، وإذا تَزَوَّجَ الثَّيِّبَ أقامَ عِنْدَها ثَلاثًا.",
    lien: "https://dorar.net/hadith/sharh/6525",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5273,
    texte: "اقْبَلِ الحَدِيقَةَ وطَلِّقْهَا تَطْلِيقَةً",
    lien: "https://dorar.net/hadith/sharh/1062",
    autres: "",
  },
]; // Fin Faune et Flore

// Allah Miséricordieux
const souratesAllahMisericordieux = [4, 7, 15,15,15,15,15,15,15,15, 16,16,16,16, 17,17,17,17,17,17,17, 18,18,18, 19,19,19,19,19,19, 21,21,21,21,21,21, 22,22,22,22, 23, 25,25,25,25,25,25,25,25, 26, 28,28, 29, 31, 32, 33,33,33,33,33, 34, 37,37,37,37,37,37, 43,43,43, 54, 59, 65,65,65, 66, 68,68,68,68, 69,69,69,69, 84, 88,88, ];
const versetsAllahMisericordieux = [47, 4, 73,74, 78,79,80,81,82,83, 26,27, 112,113, 15,16,17,18,58,97,98, 29,42,59, 68,69,70,71,72,98, 6,9,11,15,39,40, 19,20,21,22, 44, 13,14,34,36,37,38,39,40, 6, 58,59, 40, 24, 26, 64,65,66,67,68, 33, 22,23, 133,134,135,136, 24,25,55, 37, 2, 8,9,10, 6, 17,18,19,20, 4,5,6,7, 12, 23,24, ];
const ahadithsAllahMisericordieux = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
]; // Fin Allah Miséricordieux

// La haine
const souratesHaine = [ 3,3,3,3, 9,9, 59, ];
const versetsHaine = [ 118,119,120,181, 23,31, 5];
const ahadithsHaine = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
]; // Fin haine

// Erreurs ...?
const souratesErreurs = [2,2,   6,6,     7,  9,  10, 12,12,12, 16,16,16,16, 19, 23,23,23, 26, 30,30, 31, 35, 36,36,36, 54, 61, 66,66, 67, 94, "Erreurs de langue", 88, 109,109,109,109,109,109,];
const versetsErreurs = [22,258, 143,144, 57, 36, 22, 2,3,4,    15,16,48,49, 28, 12,13,14, 7,  2,3,   10, 11, 38,39,40, 1,  6,  11,12, 3,  1, "", 22, 1,2,3,4,5,6,];
const ahadithsErreurs = [
{
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
]; // Fin Erreurs....?

// Nourriture & habits
const souratesNourritureHabits = [ "Nourriture: ", 5,5,5,5,5,5, 6,6,6, 9,9, 16,16, "Habits: ", 24, 33,33,33,33, ];
const versetsNourritureHabits = [ "Hallal & Haram", 3,4,5,90,91,96, 118,121,145, 83,84, 67,115, "Le voile", 31, 53,54,55,59, ];
const ahadithsNourritureHabits = [
{
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
]; // Fin Nourriture & habits



// LA résurection
const souratesResurection = [35, 77,77,77,77,77,77,77,77, 78,78,78,78,78, 79,79,79,79,79,79,79,79,79,79,79,79,79,79,79,79,79,79,79,79, 80,80,80,80,80,80,80,80,80,80,82,82,82,84,84,84,84,84,84, 89,89,89,89,89,89,89, 99,99,99,99,99,99,99,99, 101,101,101,101,101,101,101,101,101,101,101];
const versetsResurection = [9, 8,9,10,11,12,13,14,15, 17,18,19,20,21, 6,7,8,9,10,11,12,13,14,34,35,36,37,38,39,42,43,44,45,46, 33,34,35,36,37,38,39,40,41,42, 17,18,19, 1,2,3,4,5,6, 21,22,23,24,25,26,27, 1,2,3,4,5,6,7,8, 1,2,3,4,5,6,7,8,9,10,11 ];
const ahadithsResurection= [
{
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
]; // Fin résurection,

// Sexe
const souratesSexe = ["La ...", 4,4, 17, 24,24,24,24,24,24, 25,25,25,25, 70,70,70,     "L'adultère...", 4, 24,24,24,24, "Histoire de ...",24,24,24,24,24,24,24,24,24,24, "Histoire du prophète", 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12,"Le sexe avec les esclaves est licite sans mariage.", 23,23,23,23,23,23,23,];
const versetsSexe = [ "fornication", 15,16, 32, 2,4,23,24,25,26, 68,69,70,71, 29,30,31, "",            25, 6,7,8,9,                 "IFK",11,12,13,14,15,16,17,18,19,20,                    "Joseph et le sexe",21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,`Sourate 23. ${sourates[23].nom}. ${sourates[23].nomArabe}`,  1,  2,3,4,5,6,7,];
const ahadithsSexe = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 284,
    texte:
      "أنَّ النَّبِيَّ صلَّى اللَّهُ عليهِ وسلَّمَ كان يطوفُ على نسائِهِ بِغُسلٍ واحِدٍ",
    lien: "https://dorar.net/hadith/sharh/24883",
    autres: "5215",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4139,
    texte:
      "خَرَجْنَا مع رَسولِ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ في غَزْوَةِ بَنِي المُصْطَلِقِ، فأصَبْنَا سَبْيًا مِن سَبْيِ العَرَبِ، فَاشْتَهَيْنَا النِّسَاءَ، فَاشْتَدَّتْ عَلَيْنَا العُزْبَةُ، وأَحْبَبْنَا العَزْلَ، فَسَأَلْنَا رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ، فَقالَ: ما علَيْكُم أنْ لا تَفْعَلُوا ما مِن نَسَمَةٍ كَائِنَةٍ إلى يَومِ القِيَامَةِ إلَّا وهي كَائِنَةٌ.",
    lien: "https://dorar.net/hadith/sharh/11750",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5075,
    texte:
      "كُنَّا نَغْزُو مع النَّبيِّ صلَّى اللهُ عليه وسلَّم وليسَ معنَا نِسَاءٌ، فَقُلْنَا: ألَا نَخْتَصِي؟ فَنَهَانَا عن ذلكَ، فَرَخَّصَ لَنَا بَعْدَ ذلكَ أنْ نَتَزَوَّجَ المَرْأَةَ بالثَّوْبِ، ثُمَّ قَرَأَ: {يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللَّهُ لَكُمْ} [المائدة: 87]",
    lien: "https://dorar.net/hadith/sharh/14580",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4216,
    texte:
      "أنَّ رَسولَ اللَّهِ صلَّى اللهُ عليه وسلَّمَ نَهَى عن مُتْعَةِ النِّسَاءِ يَومَ خَيْبَرَ، وعَنْ أكْلِ لُحُومِ الحُمُرِ الإنْسِيَّةِ.",
    lien: "https://dorar.net/hadith/sharh/116370",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5116,
    texte:
      "سَمِعْتُ ابْنَ عَبَّاسٍ: سُئِلَ عن مُتْعَةِ النِّسَاءِ فَرَخَّصَ، فَقالَ له مَوْلًى له: إنَّما ذلكَ في الحَالِ الشَّدِيدِ، وفي النِّسَاءِ قِلَّةٌ؟ أوْ نَحْوَهُ، فَقالَ ابنُ عَبَّاسٍ: نَعَمْ.",
    lien: "https://dorar.net/hadith/sharh/151313",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5210,
    texte:
      "أَصَبْنَا سَبْيًا، فَكُنَّا نَعْزِلُ، فَسَأَلْنَا رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ، فَقالَ: أوَإنَّكُمْ لَتَفْعَلُونَ - قالَهَا ثَلَاثًا - ما مِن نَسَمَةٍ كَائِنَةٍ إلى يَومِ القِيَامَةِ إلَّا هي كَائِنَةٌ.",
    lien: "https://dorar.net/hadith/sharh/11752",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2229,
    texte:
      "أنَّهُ بيْنَما هو جَالِسٌ عِنْدَ النبيِّ صَلَّى اللهُ عليه وسلَّمَ، قالَ: يا رَسولَ اللَّهِ، إنَّا نُصِيبُ سَبْيًا، فَنُحِبُّ الأثْمَانَ، فَكيفَ تَرَى في العَزْلِ؟ فَقالَ أوَإنَّكُمْ تَفْعَلُونَ ذلكَ؟ لا علَيْكُم أنْ لا تَفْعَلُوا ذَلِكُمْ، فإنَّهَا ليسَتْ نَسَمَةٌ كَتَبَ اللَّهُ أنْ تَخْرُجَ إلَّا هي خَارِجَةٌ.",
    lien: "https://dorar.net/hadith/sharh/11749",
    autres: "",
  },
  
]; // Fin sexe

// Histoires des prophètes
const souratesHistoiresProphetes = [
  "Adam",
  2, 2, 2, 2, 2, 2, 2, 2,
  7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7,
  20,20,20,20,20,20,20,20,20,20,20,20,20,
  
  "Jésus",
  43,
  
  "Énoch. Idrīs ",
  
  "Noé. nūḥ",
  7, 7, 7, 7, 7, 7,
  10,10,10,10,  10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,  10,  10,  10,  10,  10,  10,  10,  10,10,10,10,10,10,10,10,10,10,10,10,
  21, 21,
  23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23,
  25,
  26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26,
  29, 29,
  37, 37, 37, 37, 37, 37, 37, 37,
  51,
  54,54,54,54,54,54,54,54,
  71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,71,
  "Hud",
  7, 7, 7, 7, 7, 7, 7, 7,
  26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,
  
  "Salah",
  7,7,7,7,7,7,7,
  
  "Loth. Lût",
  7,7,7,7,7,
  
  "Chouʿayb",
  7, 7, 7, 7, 7, 7, 7, 7, 7,
  26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26,
  29,29,
  
  "Moïse",
  7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,
  19, 19, 19, 19,
  20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,
  21, 21,
  23, 23, 23, 23, 23,
  25, 25,
  26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26,
  27, 27, 27, 27, 27, 27, 27, 27,
  28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,28,
  29,
  32, 32, 32,
  37, 37, 37, 37, 37, 37, 37, 37, 37,
  40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40,
  43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43,
  44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44,
  51, 51, 51,
  54, 54, 54, 54, 54, 54, 54, 54,
  69, 69,
  79, 79, 79, 79, 79, 79, 79, 79, 79, 79, 79, 79,
  89,89,89,89,89,
  "Abraham. Ibrâhîm",
  26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,
  
  "Ismaël. Ismâʿîl",
  19, 19,
  38,38,
];
const versetsHistoiresProphetes = [
  "ādam آدم",
  30, 31, 32, 33, 34, 35, 36, 37,
  11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25,
  115,116,117,118,119,120,121,122,123,124,125,126,127,
  
  "A¨ssa",
  63,
  
  "إدريس",
  
  " نوح",
  59, 60, 61, 62, 63, 64,
  71,72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109,
  76, 77,
  23, 24, 25, 26, 27, 28, 29, 30, 39, 40, 41, 42, 43,
  37,
  105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122,
  14, 15, 
  75, 76, 77, 78, 79, 80, 81, 82,
  46,
  9,10,11,12,13,14,15,16,
  1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,
  "hūd هُود ",
  65, 66, 67, 68, 69, 70, 71, 72,
  123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,
  "[ṣāliḥ] صَالِح",
  73, 74, 75, 76, 77, 78, 79,

  "لوط",
  80, 81, 82, 83, 84,

  "شُعَيْب",
  85, 86, 87, 88, 89, 90, 91, 92, 93,
  176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,
  36, 37,
  
  "Mûsâ مُوسَى",
  103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 159,160,161,162,163,164,165,166,167,168,169,
  51, 52, 53, 54, 
  9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,
  48, 49,
  45, 46, 47, 48, 49,
  35, 36,
  10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66,
  7, 8, 9, 10, 11, 12, 13, 14,
  3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43,
  39,
  23, 24, 25,
  114,115,116,117,118,119,120,121,122,
  23,24,25,26,27,28,29,30,31,32,33, 36, 53,54,55,
  46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56,
  16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37,
  38, 39, 40,
  41, 42, 43, 44, 45, 46, 47, 48,
  9, 10,
  15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,
  10,11,12,13,14,
  
  "إبراهيم",
  69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,
  
  "إسماعيل",
  54, 55,
  48,49,
];

const ahadithsHistoiresProphetes = [
{
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1,
    texte: "",
    lien: "https://dorar.net/hadith/sharh/",
    autres: "",
  },
]; // Fin histoires des prophètes

// Clair ou Incompréhensible?
const souratesClairesIncomprehensibles = ["Versets...",2,2, 5,5,   6,   7,  10,10, 11, 12,12,12, 15, 16, 18, 19, 22, 24,24, 26,26, 27,27, 28, 32, 39, 43,43, 44, 45, 54,  "Versets ...",2,3,7,10,11,12,13,14,19,20,26,26,27,28,28,30,32,38,40,41,42,42,43,44,45,50,68,];
const versetsClairsIncomprehensibles = ["clairs!", 2,99,    15,19, 114, 52, 1,15,  1,  1,2,37,   1,  44, 1,  97, 16, 1,36,  2,195, 1,2,   2,  2,  28, 2,3,   2,  20, 17,  "Incompréhensibles!", 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 ]

const ahadithsclaires = [];// Clair ou incompréhensible?

// La carotte et le baton
const souratesCarotteEtBaton = [ "La carotte", 2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,                        3,  4,  5,5,  6,6,6,    7,7,7,7,     8,8,   9,  13, 14,14,14,14,14,14, 15,15,15,15,15,15,15,15,15, 16,16,16,16,16,16,  17,17, 18,18,18, 19,19,19,19,19,19, 21,21,21, 22,22,22,22,  24, 28, 29,29,29,29, 31,31,31, 32,32,32,32, 33,33, 34,34,34, 35,35, 37,37,37,37,37,37,37,37,37,37, 38,38,38,38,38,38,38,38,38,38, 39,39,39,39, 40,40,40,40,40,40,40,40,40,40,40,40,  43,43,43,43,43,43,43,  44,44,44,44,44,44,44,44,  48, 50,50,50, 52,52,52,52,52,52,52,52,52,52, 66, 67,67,67,67,67,67,67, 69,69,69,69,69,69,69,69,69, 70,70, 70,70,70,70,70,70,70,70,70,70,  75, 76, 77,77,77,77,77,77,77,77,77,77,77,77,77,77, 78,78,78,78,78,78,78,78,78,78, 82,82, 83,83,83,83,83, 87,87, 88,88,88,88,88,88,88, 92,92,92,92,92,92,92,92, 95, 98,98, 104,104,104,104,104 ];
const versetsCarotteEtBaton = ["", 21,28,38,39,81,103,104,105,110,112,114,126,145,151,152,161,162,165,174,257, 30, 56, 9,10, 31,32,70, 46,50,51,53, 37,38, 35, 35, 16,17,18,49,50,51, 42,43,44,45,46,47,48,49,50,  28,29,30,32,33,41,  97,98, 2,3,106, 68,69,70,71,72,73, 98,99,100, 19,20,21,22, 57, 60, 53,54,55,64, 8,9,21,   19,20,21,22, 8,56,  3,33,38,  36,37, 62,63,64,65,66,67,68,69,70,71, 55,56,57,58,59,60,61,62,63,64, 16,32,71,72, 18,22,49,60,70,71,72,73,74,75,76,77,  74,75,76,77,78,79,80,  43,44,45,46,47,48,49,50,  13, 19,20,30,  7,8,9,10,11,12,13,14,15,16,   10, 6,7,8,9,10,11,12,     25,26,27,28,29,30,31,32,33, 15,16,  35,36,37,38,39,40,41,42,43,44, 24,  4, 32,33,34,35,36,37,38,39,40,45,46,47,48,49, 21,22,23,24,25,26,27,28,29,30, 13,14, 29,30,31,32,33, 12,13, 1,2,3,4,5,6,7,        14,15,16,17,18,19,20,21, 6,  6,7,   5,6,7,8,9,]

const ahadithsCarottesEtBaton = [];// La carotte et le baton,

// Le paradis
const souratesParadis = [2, 3,3,3,3,3, 4, 10, 15,15,15,15, 16,16, 17, 18,18,18, 19,19, 21,21, 22,22, 23,  34, 35, 36,36,36, 37,37,37,37,37,37,37,37, 38,38,38,38,38, 39,39,39,39, 43,43,43,43,43,43, 44,44,44,44,44,44,44, 47,47, 52,5,52,52,52,52,52,52,52,52,52, 55,55,55,55,55,55,55,55,55,55,55,55,55,55,55, 56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56, 57,57,57,57,57, 66, 68, 69,69,69,69,69,69, 75,75, 76,76,76,76,76,76,76,76,76,76, 77,77,77,77, 78,78,78,78,78,78, 83,83,83,83,83,83,83,83,83,83,83,83,83,83,  88,88,88,88,88,88,88,88,88, ];
const versetsParadis = [25, 15,133,136,169,198, 57, 9, 45,46,47,48, 31,41, 10, 31,107,108, 61,62, 102,103, 14,23, 19, 37, 33, 55,56,57, 42,43,44,45,46,47,48,49, 50,51,52,53,54, 20,73,74,75, 68,69,70,71,72,73, 51,52,53,54,55,56,57, 2,15, 17,18,19,20,21,22,23,24,25,26,27, 46,48,50,52,54,56,58,62,64,66,68,70,72,74,76,  15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38, 12,13,14,15,21, 8, 34, 19,20,21,22,23,24, 22,23, 12,13,14,15,16,17,18,19,20,21, 41,42,43,44, 31,32,33,34,35,36, 22,23,24,25,26,27,28,29,30,31,32,33,34,35, 8,9,10,11,12,13,14,15,16, ];
const ahadithsParadis = [];// Fin Le paradis,

// L'enfer'
const souratesEnfer = [16,16,16,16, 22, 82, ]
const versetsEnfer = [34, 45,46,47, 22, 14,];
const ahadithsEnfer = [];// Fin L'enfer',

// Allah humain?
const souratesAllahHumain = ["Allah a ...", 4, "Allah...", 4,       "Allah a ...", 5,39,48, "Allah ...", 6, 3,                                "Allah...",11,13,20,69,            "Allah...",7, 15,30,32,43,43,44,86,86,   "Allah...", 16, 51, 25,         "Allah...", 2, 5, 57,57, 64,        "Allah...", 75,75, 81,84,85,85,85,85, 86,86, 90,92,92,92, 93,93, "Allah ...", 7,7,7,7,7, "Allah converse avec...", 38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,];
const versetsAllahHumain = ["un ami!", 125,    "le trompeur!", 142, "deux mains!", 64,67,10, "n'a pas de compagne, mais préfère...!", 101,42, "a un trône, sur l'eau!",7,2,5,17, "le vengeur!",136,79,47,22,25,55,16,15,16, "a des sentiments!", 23, 57,61, "demande un prêt", 245, 12, 11,18, 17, "jure!", 1,2, 15,16,1,2,3,5, 1,11, 1,1,2,3, 1,2,            "parle, écrit, compte...!",142,143,144,145,154, " les anges et Iblis",71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88  ];
const ahadithsAllahHumain = [];// Fin Allah humain,

// Coeur ou cerveau?
const souratesCoeurCerveau = [2, 22, 47, ];
const versetsCoeurCerveau = [118, 46, 24, ];
const ahadithsCoeurCerveau = [];// Fin coeur ou cerveau,

// Les défis
const souratesDefis = ["Les mequois...", 17,17,17,17,     "Allah défie ...",2,2,10, 11,11, 17,17,17,17, 28, 52, 37,37,37,37];
const versetsDefis = ["défient le prophète",90,91,92,93,  "les mequois", 23,24,38, 13,14, 88,94,95,96, 49, 34, 154,155,156,157,];
const ahadithsDefis = [];// Fin les défis,

// La Hidjra
const souratesHijra = [3, 4,4,4,4,4, 8, 9,9,9,9, 16,16, 22,22, 24];
const versetsHijra = [195, 97,98,99,100,101, 26, 20,38,39,40, 41,42, 58,59, 22];
const ahadithsHijra = [];// Fin la Hidjra,

// La logique // Contradiction
const souratesLogiqueContradictions = ["Logique et ...",4,  "Je n'ai ...",14,  24,24, 89, 105, "Le coran en ...", 12,];
const versetsLogiqueContradictions = ["contradictions", 82, "rien vu!",    28,  41,43, 6,  1,   "langue arabe!",   2, ];
const ahadithsLogiqueContradictions = [];// Fin la logique,

// Répétition / Redondance / Logique / Pas de questions
const souratesRedondances = ["Redondances...", 2,7,17,18,38,38, "Menaces de ...", 7, "Menaces de ...",5, "Ne posez pas de ...", 5,24,];
const versetsRedondances = ["Répetitions",34,11,61,50,73,74, "Pharaon", 124, "Allah", 33,                "questions...", 101, 51];
const ahadithsRedondances = [];// Fin Redondance,

// Temporalité
const souratesTemporel = [17,17,17,17,17,17,17,17,17, 24,24, 33,33,33, 93, 94,106, ];
const versetsTemporel = [ 47,48,50,51,73,74,75,76,77, 62,63, 50,51,52,  1,1,1];
const ahadithsTemporel = [];// Fin temporalité,


// Ils ont mécru
const souratesMecru = [
  "Ils ont mécru ... ", 7, 7, 10, 11, 11, 21, 23, 26, 26, 54,
  "Ils ont mécru ...", 19,
  "Ils ont mécru ...", 7,
  "Ils ont mécru ...", 17,
  "Ils ont mécru ...", 16, 17,17,17,17,17,17, 31,31, 38,38,
];

const versetsMecru = [
  "Noé", 60, 64, 73, 27, 32, 77, 24, 105, 111, 9,
  "Abraham", 46,
  "les preuves d'Allah !", 146,
  "Salah", 59,
  "Muhammad", 101, 89,90,91,92,93,94, 7,21, 67,68,
  
];

const ahadithsMecru = [];// ils ont mécru,

//////////////////,142,255, ,
// Fonction injecter les sourates selon le thème
function injecteVersets (titreThematique, sourates, versets) {
  tableau.innerHTML = "";
  
   pTitreThematique.textContent = `Versets sur ${titreThematique}`;
  tableau.appendChild(pTitreThematique)
    
  for (let index = 0; index < sourates.length; index++) {
       let divVersets = document.createElement("div");
      divVersets.setAttribute('class', 'divVerset')
      let pVerset = document.createElement("p");
    pVerset.setAttribute("class", "pVerset");
    divVersets.appendChild(pVerset);
    tableau.appendChild(divVersets)
    
    if (typeof (sourates[index]) != "number") {
      pVerset.innerHTML = `<span class="numeroVerset histoireJoseph" id='${sourates[index]}'>  ${sourates[index]}  </br> ${versets[index]}</span>`;
    } else {
      numeroSourate = sourates[index]
      numeroVerset = `s${numeroSourate}v${versets[index]}`;
    
     let sourate = coran[numeroSourate - 1]
     let verset = sourate[numeroVerset]
  
      pVerset.innerHTML = `<span class="numeroVerset">  ${numeroVerset}. </span> </br> ${verset}`;
      
    }
  }

  // Exemple versets abrogation
  /*
  if (exemples) {
    let divExemples = document.createElement("div")
    divExemples.setAttribute('class', 'divSourate')
    tableau.appendChild(divExemples)
    divExemples.innerHTML = `<h3 class = 'titreSourate'> Exemples de versets abrogés</h3> `
    exemples.forEach(exemple=> {
      let verset = "s" + exemple.s + "v" + exemple.v;
      sourate = coran[exemple.s-1]
      verset =sourate[verset]
     
      let pVerset = document.createElement('p')
      pVerset.setAttribute('class', 'pVerset')
      pVerset.innerHTML = `<span class="numeroVerset">S${exemple.s - 1}. V${
        exemple.v
      }. </span></br> ${verset}`;
      divExemples.appendChild(pVerset)
      
    })    
  }*/
  // fin exemples
}

// Fonction injecter les Ahadiths selon le thème
function injecteAhadiths(titreThematique, ahadiths) {
  tableau.innerHTML = "";

  pTitreThematique.textContent = `Ahadiths authentiques sur ${titreThematique}`;
  tableau.appendChild(pTitreThematique);
  ahadiths.forEach(hadith => {
    
    let divHadith = document.createElement('div')
    divHadith.setAttribute('class', 'carteHadith')
  divHadith.innerHTML = `
  <p> Auteur: ${hadith.auteur} </p>
  <p> Numéro du hadith: ${hadith.numero} </p>
  <p> Résumé du texte: ${hadith.texte} </p>
  <p> Plus d'infos: <a href= '${hadith.lien}'  target='_blank'> Dorar الدرر السنية</a> </p>
  `;
   tableau.appendChild(divHadith)
  })
}