let pTitreThematique = document.createElement("p")
pTitreThematique.setAttribute('class', 'pTitreThematique')
// 1- E S C L A V A G E

// Les versets de l'esclavage
const souratesEsclavage = [2, 2, 4, 4, 4, 4, 5, 8, 8, 8, 8, 8, 16, 17, 24, 24, 30, 33, 33, 33, 48, 48, 48, 58, 58, 59, 59, 59, 59]
const versetsEsclavage = [178, 221, 24, 25, 36, 92, 89, 1, 41, 69, 70, 71, 75, 72, 32, 33, 28, 26, 27, 50, 19, 20, 21, 3, 4, 5, 6, 7, 8]

// Ahadiths esclavage
let ahadithsEsclavage = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2565,
    texte: " الوَلَاءَ لِمَن أَعْتَقَ",
    lien: "https://dorar.net/hadith/sharh/12301",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2403,
    texte:
      "أَعْتَقَ رَجُلٌ غُلَامًا له عن دُبُرٍ، فَقالَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ: مَن يَشْتَرِيهِ مِنِّي؟، فَاشْتَرَاهُ نُعَيْمُ بنُ عبدِ اللَّهِ، فأخَذَ ثَمَنَهُ، فَدَفَعَهُ إلَيْهِ",
    lien: "https://dorar.net/hadith/sharh/15197",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1054,
    texte:
      "أمَرَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ بالعَتَاقَةِ في كُسُوفِ الشَّمْسِ.",
    lien: "https://dorar.net/hadith/sharh/13088",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2522,
    texte:
      "مَن أعْتَقَ شِرْكًا له في عَبْدٍ، فَكانَ له مَالٌ يَبْلُغُ ثَمَنَ العَبْدِ قُوِّمَ العَبْدُ عليه قِيمَةَ عَدْلٍ، فأعْطَى شُرَكَاءَهُ حِصَصَهُمْ، وعَتَقَ عليه العَبْدُ، وإلَّا فقَدْ عَتَقَ منه ما عَتَقَ.",
    lien: "https://dorar.net/hadith/sharh/1779",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2539,
    texte: " إمَّا المَالَ وإمَّا السَّبْيَ ",
    lien: "https://dorar.net/hadith/sharh/3449",
    autres: 2540,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2541,
    texte:" فَقَتَلَ مُقَاتِلَتَهُمْ، وسَبَى ذَرَارِيَّهُمْ، وأَصَابَ يَومَئذٍ جُوَيْرِيَةَ",
    lien: "https://dorar.net/hadith/sharh/7139",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2542,
    texte:
      " في غَزْوَةِ بَنِي المُصْطَلِقِ، فأصَبْنَا سَبْيًا مِن سَبْيِ العَرَبِ، فَاشْتَهَيْنَا النِّسَاءَ، واشْتَدَّتْ عَلَيْنَا العُزْبَةُ، وأَحْبَبْنَا العَزْلَ، فأرَدْنَا أنْ نَعْزِلَ، وقُلْنَا: نَعْزِلُ ورَسولُ اللَّهِ صلَّى اللهُ عليه وسلَّمَ بيْنَ أظْهُرِنَا قَبْلَ أنْ نَسْأَلَهُ؟! فَسَأَلْنَاهُ عن ذلكَ، فَقَالَ: ما علَيْكُم أنْ لا تَفْعَلُوا، ما مِن نَسَمَةٍ كَائِنَةٍ إلى يَومِ القِيَامَةِ إلَّا وهي كَائِنَةٌ ",
    lien: "https://dorar.net/hadith/sharh/11750",
  },

  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2545,
    texte:
      "  هُم إخوانُكم خَوَلُكم، جَعَلَهم اللهُ تحت أيْديكم، فمَن كان أخُوه تحت يَدِه فلْيُطعِمْه ممَّا يَأكُلُ، ويُلبِسْه ممَّا يَلبَسُ، ولا تُكلِّفوهم ما يَغلِبُهم، فإنْ كَلَّفتُموهم فأعينُوهم، ومَن لم يُلائِمْكم منهم فبِيعوهم، ولا تُعذِّبوا خَلْقَ اللهِ.",
    lien: "https://dorar.net/hadith/sharh/89125",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2547,
    texte:
      "أَيُّما رَجُلٍ كانَتْ له جارِيَةٌ، فأدَّبَها فأحْسَنَ تَأْدِيبَها، وأَعْتَقَها، وتَزَوَّجَها فَلَهُ أجْرانِ، وأَيُّما عَبْدٍ أدَّى حَقَّ اللَّهِ وحَقَّ مَوالِيهِ فَلَهُ أجْرانِ. ",
    lien: "https://dorar.net/hadith/sharh/7285",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2548,
    texte:
      "لِلْعَبْدِ المَمْلُوكِ الصَّالِحِ أجْرانِ. والذي نَفْسِي بيَدِهِ، لَوْلا الجِهادُ في سَبيلِ اللَّهِ، والحَجُّ، وبِرُّ أُمِّي؛ لَأَحْبَبْتُ أنْ أمُوتَ وأنا مَمْلُوكٌ. ",
    lien: "https://dorar.net/hadith/sharh/118993",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2549,
    texte:
      " نِعْمَ ما لأحَدِهِمْ يُحْسِنُ عِبادَةَ رَبِّهِ ويَنْصَحُ لِسَيِّدِهِ.",
    lien: "https://dorar.net/hadith/sharh/4819",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2552,
    texte: "لا يقولَنَّ أحدُكم عبدي وأمتي ولكن ليقُلْ فتاي وفتاتي ",
    lien: "https://dorar.net/hadith/sharh/110854",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2557,
    texte:
      "إذا أتَى أحَدَكُمْ خادِمُهُ بطَعامِهِ، فإنْ لَمْ يُجْلِسْهُ معهُ، فَليُناوِلْهُ لُقْمَةً أوْ لُقْمَتَيْنِ، أوْ أُكْلَةً أوْ أُكْلَتَيْنِ؛ فإنَّه ولِيَ عِلاجَهُ.",
    lien: "https://dorar.net/hadith/sharh/33060",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2592,
    texte: "أَمَا إنَّكِ لو أَعْطَيْتِهَا أَخْوَالَكِ كانَ أَعْظَمَ لأجْرِكِ.",
    lien: "https://dorar.net/hadith/sharh/16247",
    autres: 2594,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3754,
    texte:
      "كانَ عُمَرُ يقولُ: أبو بَكْرٍ سَيِّدُنَا، وأَعْتَقَ سَيِّدَنَا. يَعْنِي بلَالًا.",
    lien: "https://dorar.net/hadith/sharh/68882",
    autres: 3755,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3804,
    texte:
      "فإنِّي أحْكُمُ فيهم أنْ تُقْتَلَ مُقَاتِلَتُهُمْ وتُسْبَى ذَرَارِيُّهُمْ، قالَ: حَكَمْتَ بحُكْمِ اللَّهِ ",
    lien: "https://dorar.net/hadith/sharh/7125",
    autres: 4122,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6716,
    texte:" مَن يَشْتَرِيهِ مِنِّي؟ فاشْتَراهُ نُعَيْمُ بنُ النَّحَّامِ بثَمانِ مِائَةِ دِرْهَمٍ.",
    lien: "https://dorar.net/hadith/sharh/15197",
  },
];  
// Fin Esclavage

// 2- A L L A H   O M N I P O T E N T
const souratesAllahOmnipotent = [2, 2, 2, 3, 3, 6, 4, 6, 6, 6, 7, 9, 9, 40 ]
const versetsAllahOmnipotent = [143, 181, 244, 13, 140, 166, 141, 18, 103, 115, 187, 77, 79, 68]

let ahadithsAllahOmnipotent = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero:4584,
    texte:"أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ",
    lien: "https://dorar.net/hadith/sharh/65277",
  },
];


// 3- Djihad / Violence

const souratesDjihadViolence = [
  2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 5, 6, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8,
  9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9,
  22,24,33,33,33,33,47,47,49,61,61,61,66
];
const versetsDjihadViolence = [154, 191, 216, 217, 140, 141, 142, 143, 146, 147, 148, 154, 155, 156, 157, 34, 71, 72, 73, 74, 77, 85, 89, 90, 91, 94, 95, 102, 103, 104, 33, 65, 1, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 39, 43, 44, 45, 57, 58, 60, 65, 66, 67,
  2, 5, 12, 14, 25, 26, 29, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 73, 74, 81, 82, 83, 88, 93, 111, 123,
  78,4,19,20,60,61,4,35,15,4,10,11,9
];
const ahadithsDjihadViolence = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 25,
    texte:
      " أُمِرْتُ أنْ أُقَاتِلَ النَّاسَ حتَّى يَشْهَدُوا أنْ لا إلَهَ إلَّا اللَّهُ، وأنَّ مُحَمَّدًا رَسولُ اللَّهِ، ويُقِيمُوا الصَّلَاةَ، ويُؤْتُوا الزَّكَاةَ، فَإِذَا فَعَلُوا ذلكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وأَمْوَالَهُمْ إلَّا بحَقِّ الإسْلَامِ، وحِسَابُهُمْ علَى اللَّهِ.",
    verset: "s9v5",
    lien: "https://dorar.net/hadith/sharh/68099",
    autres: 1399,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 26,
    texte: "أفضَلُ الأعمالِ الإيمانُ باللهِ وَحدَه ، ثمَّ الجهادُ... ",
    lien: "https://dorar.net/hadith/sharh/141857",
    autres: 1519,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 123,
    texte:
      "مَن قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هي العُلْيَا، فَهو في سَبيلِ اللَّهِ عزَّ وجلَّ. ",
    lien: "https://dorar.net/hadith/sharh/8229",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1399,
    texte: "واللَّهِ لَأُقَاتِلَنَّ مَن فَرَّقَ بيْنَ الصَّلَاةِ والزَّكَاةِ ",
    lien: "https://dorar.net/hadith/sharh/67078",
    autres: 1456,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1501,
    texte:
      " فَأُتِيَ بهِمْ، فَقَطَّعَ أيْدِيَهُمْ وأَرْجُلَهُمْ، وسَمَرَ أعْيُنَهُمْ، وتَرَكَهُمْ بالحَرَّةِ يَعَضُّونَ الحِجَارَةَ.",
    lien: "https://dorar.net/hadith/sharh/33629",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 428,
    texte:
      "يا بَنِي النَّجَّارِ ثامِنُونِي بحائِطِكُمْ، قالوا: لا نَطْلُبُ ثَمَنَهُ، إلَّا إلى اللَّهِ. ",
    lien: "https://dorar.net/hadith/sharh/15455",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3995,
    texte:
      " هذا جِبْرِيلُ آخِذٌ برَأْسِ فَرَسِهِ عليه أدَاةُ الحَرْبِ.",
    lien: "https://dorar.net/hadith/sharh/11475",
    autres: 4041,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4037,
    texte: "مَن لِكَعْبِ بنِ الأشْرَفِ؛ فإنَّه قدْ آذَى اللَّهَ ورَسولَهُ؟ ",
    lien: "https://dorar.net/hadith/sharh/4176",
    autres: 2510,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2541,
    texte:
      " إنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّمَ أغَارَ علَى بَنِي المُصْطَلِقِ وهُمْ غَارُّونَ، وأَنْعَامُهُمْ تُسْقَى علَى المَاءِ، فَقَتَلَ مُقَاتِلَتَهُمْ، وسَبَى ذَرَارِيَّهُمْ، وأَصَابَ يَومَئذٍ جُوَيْرِيَةَ.",
    lien: "https://dorar.net/hadith/sharh/7139",
    autres: 3804
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4304,
    texte:
      " والذي نفسُ محمدٍ بيدِه لو أن فاطمةَ بنتَ محمدٍ سَرَقَتْ لقَطَعَتُ يدَها. ",
    lien: "https://dorar.net/hadith/sharh/2028",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2926,
    texte: " لا تَقُومُ السَّاعَةُ حتَّى تُقاتِلُوا اليَهُودَ، حتَّى يَقُولَ الحَجَرُ وراءَهُ اليَهُودِيُّ: يا مُسْلِمُ، هذا يَهُودِيٌّ وَرائي فاقْتُلْهُ.",
    lien: "https://dorar.net/hadith/sharh/15003",
    autres: 3593
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4032,
    texte: " حرَّقَ رسولُ اللَّهِ صلَّى اللَّهُ علَيهِ وسلَّمَ نخلَ بَني النَّضيرِ وقطَّعَ، وَهيَ البوَيْرةُ، فأنزلَ اللَّهُ مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ",
    lien: "https://dorar.net/hadith/sharh/5268",
    autres: 4028
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4039,
    texte: "  بَعَثَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ رَهْطًا مِنَ الأنْصَارِ إلى أبِي رَافِعٍ فَدَخَلَ عليه عبدُ اللَّهِ بنُ عَتِيكٍ بَيْتَهُ لَيْلًا فَقَتَلَهُ وهو نَائِمٌ.",
    lien: "https://dorar.net/hadith/sharh/24040",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4050,
    texte: " أنَّ النبيَّ صَلَّى اللَّهُ عليه وَسَلَّمَ خَرَجَ إلى أُحُدٍ، فَرَجَعَ نَاسٌ مِمَّنْ كانَ معهُ، فَكانَ أَصْحَابُ النبيِّ صَلَّى اللَّهُ عليه وَسَلَّمَ فيهم فِرْقَتَيْنِ، قالَ بَعْضُهُمْ: نَقْتُلُهُمْ، وَقالَ بَعْضُهُمْ: لَا، فَنَزَلَتْ {فَما لَكُمْ في المُنَافِقِينَ فِئَتَيْنِ} [النساء: 88].",
    lien: "https://dorar.net/hadith/sharh/6074",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2664,
    texte: "  أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ: عَرَضَهُ يَومَ أُحُدٍ وهو ابنُ أرْبَعَ عَشْرَةَ سَنَةً، فَلَمْ يُجِزْهُ، وعَرَضَهُ يَومَ الخَنْدَقِ، وهو ابنُ خَمْسَ عَشْرَةَ سَنَةً، فأجَازَهُ.",
    lien: "https://dorar.net/hadith/sharh/25633",
    autres: 4097
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2813,
    texte: "لَمَّا رَجَعَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ مِنَ الخَنْدَقِ، ووَضَعَ السِّلَاحَ واغْتَسَلَ، أتَاهُ جِبْرِيلُ عليه السَّلَامُ، فَقالَ: قدْ وضَعْتَ السِّلَاحَ؟ واللَّهِ ما وضَعْنَاهُ، فَاخْرُجْ إليهِم قالَ: فَإِلَى أيْنَ؟ قالَ: هَا هُنَا، وأَشَارَ إلى بَنِي قُرَيْظَةَ، فَخَرَجَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إليهِم ",
    lien: "https://dorar.net/hadith/sharh/21196",
    autres: 4117
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4123,
    texte: "قَالَ رَسولُ اللَّهِ صلَّى اللهُ عليه وسلَّمَ يَومَ قُرَيْظَةَ لِحَسَّانَ بنِ ثَابِتٍ: اهْجُ المُشْرِكِينَ؛ فإنَّ جِبْرِيلَ معكَ. ",
    lien: "https://dorar.net/hadith/sharh/14401",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4138,
    texte: " خَرَجْنَا مع رَسولِ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ في غَزْوَةِ بَنِي المُصْطَلِقِ، فأصَبْنَا سَبْيًا مِن سَبْيِ العَرَبِ، فَاشْتَهَيْنَا النِّسَاءَ، فَاشْتَدَّتْ عَلَيْنَا العُزْبَةُ، وأَحْبَبْنَا العَزْلَ، فَسَأَلْنَا رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ، فَقالَ: ما علَيْكُم أنْ لا تَفْعَلُوا ما مِن نَسَمَةٍ كَائِنَةٍ إلى يَومِ القِيَامَةِ إلَّا وهي كَائِنَةٌ.",
    lien: "https://dorar.net/hadith/sharh/11750",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4192,
    texte: " ... فأمرَ بِهِم فقُطِعَت أيديهم وأرجلُهُم وسمرَ أعينُهُم ، وألقَوا في الحرَّةِ يستَسقونَ فلا يُسقونَ",
    lien: "https://dorar.net/hadith/sharh/10926",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4197 ,
    texte: " أنَّ رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ أتَى خَيْبَرَ لَيْلًا، وكانَ إذا أتَى قَوْمًا بلَيْلٍ لَمْ يُغِرْ بهِمْ حتَّى يُصْبِحَ، فَلَمَّا أصْبَحَ خَرَجَتِ اليَهُودُ بمَساحِيهِمْ، ومَكاتِلِهِمْ فَلَمَّا رَأَوْهُ قالوا: مُحَمَّدٌ واللَّهِ، مُحَمَّدٌ والخَمِيسُ، فقالَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ: خَرِبَتْ خَيْبَرُ، إنَّا إذا نَزَلْنا بساحَةِ قَوْمٍ {فَساءَ صَباحُ المُنْذَرِينَ} [الصافات: 177]",
    lien: "https://dorar.net/hadith/sharh/24120",
    autres: "371, 4200, 4201, 4211, 4213"
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero:4286 ,
    texte: " عن أنسِ بنِ مالكٍ, أنَّ رسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم دخل مكةَ عامَ الفتحِ, وعلى رأسِه المغفَرُ, فلما نزعَه, جاءَه رجلٌ فقال : ابنُ خطلٍ متعلِّقٌ بأستارِ الكعبةِ, فقال ( رسولُ اللهِ صلَّى اللهُ عليهِ وسلَّم ) اقتلوهُ",
    lien: "https://dorar.net/hadith/sharh/79443",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4274,
    texte: " فَقالَ عُمَرُ: يا رَسولَ اللَّهِ، دَعْنِي أضْرِبْ عُنُقَ هذا المُنَافِقِ، فَقالَ: إنَّه قدْ شَهِدَ بَدْرًا، وما يُدْرِيكَ لَعَلَّ اللَّهَ اطَّلَعَ علَى مَن شَهِدَ بَدْرًا، فَقالَ: اعْمَلُوا ما شِئْتُمْ؛ فقَدْ غَفَرْتُ لَكُمْ. فأنْزَلَ اللَّهُ السُّورَةَ: {يَاأَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَقَدْ كَفَرُوا بِمَا جَاءَكُمْ مِنَ الْحَقِّ} إلى قَوْلِهِ: {فقَدْ ضَلَّ سَوَاءَ السَّبِيلِ} [الممتحنة: 1]",
    lien: "https://dorar.net/hadith/sharh/117689",
    autres: 2494
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4304,
    texte: "والذي نَفْسُ مُحَمَّدٍ بيَدِهِ، لو أنَّ فاطِمَةَ بنْتَ مُحَمَّدٍ سَرَقَتْ، لَقَطَعْتُ يَدَها. ثُمَّ أمَرَ رَسولُ اللَّهِ صلَّى اللهُ عليه وسلَّمَ بتِلْكَ المَرْأَةِ، فَقُطِعَتْ يَدُها، فَحَسُنَتْ تَوْبَتُها بَعْدَ ذلكَ وتَزَوَّجَتْ. قالَتْ عائِشَةُ: فَكانَتْ تَأْتي بَعْدَ ذلكَ فأرْفَعُ حاجَتَها إلى رَسولِ اللَّهِ صلَّى اللهُ عليه وسلَّمَ. ",
    lien: "https://dorar.net/hadith/sharh/82722",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4339,
    texte: " اللَّهُمَّ إنِّي أبْرَأُ إلَيْكَ ممَّا صَنَعَ خَالِدُ بنُ الوَلِيدِ مَرَّتَيْنِ.",
    lien: "https://dorar.net/hadith/sharh/24160",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3949,
    texte: " كنتُ إلى جنبِ زيدِ بنِ أرقمَ فقيلَ لهُ : كم غزا النَّبيُّ صلَّى اللَّهُ عليهِ وسلَّمَ من غزوةٍ قالَ : تسعَ عشرةَ فقلتُ : كم غزوتَ أنتَ معهُ ؟قالَ : سبعَ عشرةَ ، قلتُ : وأيَّتُهنَّ كانَ أوَّلَ ؟ قالَ : ذاتُ العُشَيراءِ – أو العُسَيراءِ -",
    lien: "https://dorar.net/hadith/sharh/12021",
    autres: 4471
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1884,
    texte: " رَجَعَ نَاسٌ مِن أصْحَابِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ مِن أُحُدٍ، وكانَ النَّاسُ فيهم فِرْقَتَيْنِ: فَرِيقٌ يقولُ: اقْتُلْهُمْ، وفَرِيقٌ يقولُ: لَا، فَنَزَلَتْ: {فَما لَكُمْ في المُنَافِقِينَ فِئَتَيْنِ}",
    lien: "https://dorar.net/hadith/sharh/6072",
    autres: 4589
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4592,
    texte: "لَا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ} {وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ} [النساء: 95] ",
    lien: "https://dorar.net/hadith/sharh/3173",
    autres: 4990
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3377,
    texte: "  لا يضربُ أحدُكم امرأتَه ضربَ الأمةِ ثم يضاجعُها",
    lien: "https://dorar.net/hadith/sharh/138072",
    autres: 5204
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5295,
    texte: " أنَّ يَهُودِيًّا قَتَلَ جَارِيَةً علَى أوْضَاحٍ لَهَا، فَقَتَلَهَا بحَجَرٍ، فَجِيءَ بهَا إلى النبيِّ صَلَّى اللهُ عليه وسلَّمَ وبِهَا رَمَقٌ، فَقالَ: أقَتَلَكِ فُلَانٌ؟ فأشَارَتْ برَأْسِهَا: أنْ لَا، ثُمَّ قالَ الثَّانِيَةَ، فأشَارَتْ برَأْسِهَا: أنْ لَا، ثُمَّ سَأَلَهَا الثَّالِثَةَ، فأشَارَتْ برَأْسِهَا: أنْ نَعَمْ، فَقَتَلَهُ النبيُّ صَلَّى اللهُ عليه وسلَّمَ بحَجَرَيْنِ.",
    lien: "https://dorar.net/hadith/sharh/8019",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5357,
    texte: " كان يبيعُ نخلَ بني النضيرِ ، ويحبِسُ لأهْلِهِ قوتَ سنتِهم",
    lien: "https://dorar.net/hadith/sharh/24736",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6777,
    texte: " أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ ضَرَبَ في الخَمْرِ بالجَرِيدِ والنِّعالِ، وجَلَدَ أبو بَكْرٍ أرْبَعِينَ.",
    lien: "https://dorar.net/hadith/sharh/11762",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6789,
    texte: " لَا تُقْطَعُ يَدُ السَّارِقِ إلَّا في رُبْعِ دِينَارٍ فَصَاعِدًا.",
    lien: "https://dorar.net/hadith/sharh/4920",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6812,
    texte: " عَنْ عَلِيٍّ رَضِيَ اللَّهُ عنْه حِينَ رَجَمَ المَرْأَةَ يَومَ الجُمُعَةِ، وقالَ: قدْ رَجَمْتُهَا بسُنَّةِ رَسولِ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ.",
    lien: "https://dorar.net/hadith/sharh/67065",
    
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6840,
    texte: " رَجَمَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ فَقُلتُ: أقَبْلَ النُّورِ أمْ بَعْدَهُ؟ قالَ: لا أدْرِي.",
    lien: "https://dorar.net/hadith/sharh/11551",
    
  },
];


// Fonction injecter les sourates selon le thème

function injecteVersets (titreThematique, sourates, versets) {
  
  tableau.innerHTML = "";
  
   pTitreThematique.textContent = `Versets sur ${titreThematique}`;
  tableau.appendChild(pTitreThematique)
    
  for (let index = 0; index < sourates.length; index++) {
    numeroSourate = sourates[index]
    numeroVerset = `s${numeroSourate}v${versets[index]}`;
    
    sourate = coran[numeroSourate-1] 
     
    verset = sourate[numeroVerset]
  
      let divVersets = document.createElement("div");
      let pVerset = document.createElement("p");
      pVerset.setAttribute("class", "pVerset");
      divVersets.appendChild(pVerset);
  
    pVerset.innerHTML = `<span class="numeroVerset">  ${numeroVerset}. </span> </br> ${verset}`;
        tableau.appendChild(divVersets)
    }
}

// Fonction injecter les Ahadiths selon le thème

function injecteAhadiths(titreThematique, ahadiths) {
  tableau.innerHTML = "";

  pTitreThematique.textContent = `Ahadiths authentiques sur ${titreThematique}`;
  tableau.appendChild(pTitreThematique);
  ahadiths.forEach(hadith => {
    console.log(hadith);
    
  
    let divHadith = document.createElement('div')
    divHadith.setAttribute('class', 'carteHadith')
  divHadith.innerHTML = `
  <p> Auteur: ${hadith.auteur} </p>
  <p> Numéro du hadith: ${hadith.numero} </p>
  <p> Résumé du texte: ${hadith.texte} </p>
  <p> Plus d'infos: <a href= '${hadith.lien}'  target='_blank'> Dorar الدرر السنية</a> </p>
  `;
   tableau.appendChild(divHadith)
  })
}