// 1- Le djihad offensif -->
const souratesDjihadOffensif = [2,  2,   2,   3,   3,   3,   4, 4,   4, 4,4,   4, 4,  4,   4,   4,   5, 8, 8, 8,    9, 9, 9,   9,  9,   9, 9,9,   9,  9,  9,  9,  9,   9, 9,   9, 9,   9, 9,  9,  9,  9, 9, 9,    9,  9,   9,   22, 29, 47, 47,49, 61, 61, 61, 66,];
const versetsDjihadOffensif = [190, 191, 216, 146, 155, 156, 71, 72, 73,74,77, 89, 91, 95, 102, 104, 33, 14,39, 44, 5, 12, 14, 25, 26, 29, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49,73, 74, 81, 82, 83, 88, 93, 111, 123, 78, 69, 4,  35, 15, 4, 10, 11,  9,];
const ahadithsDjihadOffensif = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 123,
    texte: "مَن قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هي العُلْيَا، فَهو في سَبيلِ اللَّهِ عزَّ وجلَّ. ",
    lien: "https://dorar.net/hadith/sharh/8229",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 428,
    texte:
      "يا بَنِي النَّجَّارِ ثامِنُونِي بحائِطِكُمْ، قالوا: لا نَطْلُبُ ثَمَنَهُ، إلَّا إلى اللَّهِ. ",
    lien: "https://dorar.net/hadith/sharh/15455",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3995,
    texte: " هذا جِبْرِيلُ آخِذٌ برَأْسِ فَرَسِهِ عليه أدَاةُ الحَرْبِ.",
    lien: "https://dorar.net/hadith/sharh/11475",
    autres: 4041,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2541,
    texte:
      " إنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّمَ أغَارَ علَى بَنِي المُصْطَلِقِ وهُمْ غَارُّونَ، وأَنْعَامُهُمْ تُسْقَى علَى المَاءِ، فَقَتَلَ مُقَاتِلَتَهُمْ، وسَبَى ذَرَارِيَّهُمْ، وأَصَابَ يَومَئذٍ جُوَيْرِيَةَ.",
    lien: "https://dorar.net/hadith/sharh/7139",
    autres: 3804,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2926,
    texte:
      " لا تَقُومُ السَّاعَةُ حتَّى تُقاتِلُوا اليَهُودَ، حتَّى يَقُولَ الحَجَرُ وراءَهُ اليَهُودِيُّ: يا مُسْلِمُ، هذا يَهُودِيٌّ وَرائي فاقْتُلْهُ.",
    lien: "https://dorar.net/hadith/sharh/15003",
    autres: 3593,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4032,
    texte: " حرَّقَ رسولُ اللَّهِ صلَّى اللَّهُ علَيهِ وسلَّمَ نخلَ بَني النَّضيرِ وقطَّعَ، وَهيَ البوَيْرةُ، فأنزلَ اللَّهُ مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ",
    lien: "https://dorar.net/hadith/sharh/5268",
    autres: 4028,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2664,
    texte:
      "  أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ: عَرَضَهُ يَومَ أُحُدٍ وهو ابنُ أرْبَعَ عَشْرَةَ سَنَةً، فَلَمْ يُجِزْهُ، وعَرَضَهُ يَومَ الخَنْدَقِ، وهو ابنُ خَمْسَ عَشْرَةَ سَنَةً، فأجَازَهُ.",
    lien: "https://dorar.net/hadith/sharh/25633",
    autres: 4097,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2813,
    texte:
      "لَمَّا رَجَعَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ مِنَ الخَنْدَقِ، ووَضَعَ السِّلَاحَ واغْتَسَلَ، أتَاهُ جِبْرِيلُ عليه السَّلَامُ، فَقالَ: قدْ وضَعْتَ السِّلَاحَ؟ واللَّهِ ما وضَعْنَاهُ، فَاخْرُجْ إليهِم قالَ: فَإِلَى أيْنَ؟ قالَ: هَا هُنَا، وأَشَارَ إلى بَنِي قُرَيْظَةَ، فَخَرَجَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إليهِم ",
    lien: "https://dorar.net/hadith/sharh/21196",
    autres: 4117,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4123,
    texte:
      "قَالَ رَسولُ اللَّهِ صلَّى اللهُ عليه وسلَّمَ يَومَ قُرَيْظَةَ لِحَسَّانَ بنِ ثَابِتٍ: اهْجُ المُشْرِكِينَ؛ فإنَّ جِبْرِيلَ معكَ. ",
    lien: "https://dorar.net/hadith/sharh/14401",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4197,
    texte:
      " أنَّ رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ أتَى خَيْبَرَ لَيْلًا، وكانَ إذا أتَى قَوْمًا بلَيْلٍ لَمْ يُغِرْ بهِمْ حتَّى يُصْبِحَ، فَلَمَّا أصْبَحَ خَرَجَتِ اليَهُودُ بمَساحِيهِمْ، ومَكاتِلِهِمْ فَلَمَّا رَأَوْهُ قالوا: مُحَمَّدٌ واللَّهِ، مُحَمَّدٌ والخَمِيسُ، فقالَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ: خَرِبَتْ خَيْبَرُ، إنَّا إذا نَزَلْنا بساحَةِ قَوْمٍ {فَساءَ صَباحُ المُنْذَرِينَ} [الصافات: 177]",
    lien: "https://dorar.net/hadith/sharh/24120",
    autres: "371, 4200, 4201, 4211, 4213",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3949,
    texte: " كنتُ إلى جنبِ زيدِ بنِ أرقمَ فقيلَ لهُ : كم غزا النَّبيُّ صلَّى اللَّهُ عليهِ وسلَّمَ من غزوةٍ قالَ : تسعَ عشرةَ فقلتُ : كم غزوتَ أنتَ معهُ ؟قالَ : سبعَ عشرةَ ، قلتُ : وأيَّتُهنَّ كانَ أوَّلَ ؟ قالَ : ذاتُ العُشَيراءِ – أو العُسَيراءِ -",
    lien: "https://dorar.net/hadith/sharh/12021",
    autres: 4471,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4592,
    texte:"لَا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ} {وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ} [النساء: 95] ",
    lien: "https://dorar.net/hadith/sharh/3173",
    autres: 4990,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 25,
    texte: " أُمِرْتُ أنْ أُقَاتِلَ النَّاسَ حتَّى يَشْهَدُوا أنْ لا إلَهَ إلَّا اللَّهُ، وأنَّ مُحَمَّدًا رَسولُ اللَّهِ، ويُقِيمُوا الصَّلَاةَ، ويُؤْتُوا الزَّكَاةَ، فَإِذَا فَعَلُوا ذلكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وأَمْوَالَهُمْ إلَّا بحَقِّ الإسْلَامِ، وحِسَابُهُمْ علَى اللَّهِ.",
    verset: "s9v5",
    lien: "https://dorar.net/hadith/sharh/68099",
    autres: 1399,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 26,
    texte: "أفضَلُ الأعمالِ الإيمانُ باللهِ وَحدَه ، ثمَّ الجهادُ... ",
    lien: "https://dorar.net/hadith/sharh/141857",
    autres: 1519,
  },
  {
    auteur: "صحيح البخاري",
    numero: 3995,
    texte: " هذا جبريلُ آخِذٌ برأْسِ فرَسِهِ ، عليه أداةُ الحرْبِ ",
    lien: "https://dorar.net/hadith/sharh/68773",
    autres: "الطبراني (11/ 342) (11952)، والبيهقي في ((دلائل النبوة)) (3/ 54)",
  },
];

// 2- Mourir en martyr -->
const souratesMourirEnMartyr = [2,  3,   3,   3,   3,   3,   3,   3,    3, 3,  3,   4,  4,   9, 47,47,47,];
const versetsMourirEnMartyr = [154, 140, 141, 142, 143, 147, 148, 157, 169,170,171, 74, 77,  111, 4,5,6,];
const ahadithsMourirEnMartyr = [
  {
    auteur: " صحيح الترمذي",
    numero: 1663,
    texte: "للشهيدِ عندَ اللهِ ستُّ خصالٍ ...",
    lien: "https://dorar.net/hadith/sharh/35616",
    autres: " ابن ماجه (2799)، وأحمد (17182)",
  },
  {
    auteur: "صحيح البخاري",
    numero: 2817,
    texte:
      " ما مِن أحَدٍ يَدخُلُ الجَنَّةَ يُحِبُّ أن يَرجِعَ إلى الدُّنيا، وأنَّ له ما على الأرضِ مِن شيءٍ، غَيرُ الشَّهيدِ",
    lien: "https://dorar.net/hadith/sharh/3054",
    autres: "مسلم (1877)",
  },
  {
    auteur: "صحيح البخاري",
    numero: 2829,
    texte:
      "الشُّهداءُ خمسةٌ : المطعونُ والمبطونُ والغرِقُ وصاحبُ الهدمِ والشَّهيدُ في سبيلِ اللهِ ",
    lien: "https://dorar.net/hadith/sharh/6985",
    autres: "مسلم (1914)",
  },
  {
    auteur: "ابن حبان",
    numero: 186,
    texte: "سيِّدُ الشُّهداءِ حمزةُ بنُ عبدِ المطَّلبِ  ...",
    lien: "https://dorar.net/hadith/sharh/112385",
    autres: "الحاكم (4884)، والديلمي في ((الفردوس)) (3472)",
  },
  {
    auteur: "صحيح أبي داود ",
    numero: 1520,
    texte:
      "من سألَ اللَّهَ الشَّهادةَ صادقًا بلَّغَه اللَّهُ منازلَ الشُّهداءِ وإن ماتَ علَى فراشِه",
    lien: "https://dorar.net/hadith/sharh/36993",
    autres: "مسلم (1909)",
  },
  {
    auteur: "صحيح مسلم",
    numero: 1886,
    texte:
      "أولُ ما يُهراقُ مِنْ دمِ الشهيدِ ، يُغفَرُ له ذنبُهُ كلُّهُ إلَّا الدَّيْنَ",
    lien: "https://dorar.net/hadith/sharh/131405",
    autres:
      "الطبراني (6/73) (5552) واللفظ له، والحاكم (2555)، والبيهقي (18992)",
  },
  {
    auteur: "صحيح البخاري",
    numero: 237,
    texte:
      "ما مِن مَكلومٍ يُكلَمُ في سَبيلِ اللهِ إلَّا جاءَ يَومَ القيامةِ وكَلْمُه يَدمَى، اللَّونُ لَونُ دَمٍ، والرِّيحُ ريحُ مِسكٍ. ",
    lien: "https://dorar.net/hadith/sharh/14597",
    autres: "مسلم (1876)",
  },
  {
    auteur: "صحيح البخاري",
    numero: 2797,
    texte:
      " والَّذي نَفسِي بيدِهِ ، لولا أنَّ رِجالًا مِن المؤمنينَ لا تَطيبُ أنفسُهُم أن يتخلَّفُوا عنِّي ...",
    lien: "https://dorar.net/hadith/sharh/14597",
    autres: " صحيح ابن حبان(4737)",
  },
  {
    auteur: "صحيح الجامع",
    numero: 912,
    texte:
      "أرواحُ المؤمِنينَ في أجوافِ طيْرٍ خُضْرٍ تُعلَّقُ في أشْجارِ الجنةِ ، حتى يَرُدَّها اللهُ إلى أجْسادِها يومَ القيامةِ ",
    lien: "https://dorar.net/hadith/sharh/146528",
    autres: " الطبراني (19/65) (122)، وأبو نعيم في ((معرفة الصحابة)) (8037) ",
  },
];

// 3- La violence conjugale -->
const souratesViolenceConjugale = [4,4,4,];
const versetsViolenceConjugale = [34,35,128];
const ahadithsViolenceConjugale = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3377,
    texte: "  لا يضربُ أحدُكم امرأتَه ضربَ الأمةِ ثم يضاجعُها",
    lien: "https://dorar.net/hadith/sharh/138072",
    autres: 5204,
  },
  {
    auteur: " صحيح مسلم ",
    numero: 3377,
    texte: " فلَهَدَني في صَدْري لَهْدَةً أوجَعَتْني ",
    lien: "https://dorar.net/hadith/sharh/12880",
    autres: "أحمد (25855) واللفظ له، والنسائي (2037)، وعبد الرزاق (6712)",
  },
  {
    auteur: "  صحيح الأدب المفرد ",
    numero: 933,
    texte: " عَلِّقُوا السَّوْطَ حيثُ يَرَاهُ أهلُ البيتِ , فإنه أَدَبٌ لهم ",
    lien: "https://dorar.net/hadith/sharh/110399",
    autres:
      "الطبراني (10/344) (10671)، وابن عدي في ((الكامل في الضعفاء)) (3/90)، والخطيب في ((تاريخ بغداد)) (12/203) البخاري في ((الأدب المفرد)) (1229)، وابن أبي الدنيا في ((النفقة على العيال)) (322) واللفظ لهما، وعبد الرزاق (17963)",
  },
  {
    auteur: "  صحيح أبي داود ",
    numero: 2146,
    texte: "لا تضرِبوا إماءَ اللَّهِ ... ",
    lien: "https://dorar.net/hadith/sharh/73127",
    autres: " النسائي في ((السنن الكبرى)) (9167) ابن ماجه (1985)",
  },
  {
    auteur: "  صحيح أبي داود ",
    numero: 1905,
    texte: " اتَّقوا اللهَ في النساءِ؛ فإنَّكم أخذتُموهنَّ بأمانةِ الله ... ",
    lien: "https://dorar.net/hadith/sharh/91552",
    autres: " النسائي في ((الكبرى)) (9135)، وابن خزيمة (2809) ",
  },
];

// 4- La violence contre les enfants -->
const souratesViolenceEnfants = [18,18,18,37, ];
const versetsViolenceEnfants = [74,80,81,102, ];
const ahadithsViolenceEnfants = [
  {
    auteur: "  صحيح الأدب المفرد ",
    numero: 933,
    texte: " عَلِّقُوا السَّوْطَ حيثُ يَرَاهُ أهلُ البيتِ , فإنه أَدَبٌ لهم ",
    lien: "https://dorar.net/hadith/sharh/110399",
    autres:
      "الطبراني (10/344) (10671)، وابن عدي في ((الكامل في الضعفاء)) (3/90)، والخطيب في ((تاريخ بغداد)) (12/203) البخاري في ((الأدب المفرد)) (1229)، وابن أبي الدنيا في ((النفقة على العيال)) (322) واللفظ لهما، وعبد الرزاق (17963)",
  },

  {
    auteur: "  صحيح أبي داود ",
    numero: 495,
    texte: "مُرُوا أولادَكُم بالصلاةِ وهُم أبناءُ سبعِ سنينَ ، واضرِبُوهُم عليهَا وهُمْ أبْنَاءُ عَشْرٍ وفرِّقُوا بينِهِم في المَضَاجِعِ ",
    lien: "https://dorar.net/hadith/sharh/66400",
    autres:"أحمد (6689)",
  },
];

// 5- Exécution des apostats-- >
const souratesExecutionApostats = [2,2,2,      3,3,3,3,3,       4,   5,  16,  47,47,47,];
const versetsExecutionApostats = [217,109,217, 86,87,88,89,90,  137, 54, 106, 25,26,27,];
const ahadithsExecutionApostats = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3017,
    texte: "مَن بدَّلَ دينَه فاقتُلوهُ",
    lien: "https://dorar.net/hadith/sharh/5702",
    autres: "صحيح ابن ماجه | الصفحة أو الرقم : 2070",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6878,
    texte:
      "لا يحِلُّ دمُ امرءٍ مسلمٍ إلَّا بإحدَى ثلاثٍ , الزِّنَى , والنَّفسُ بالنَّفسِ , والتَّاركُ لدينِه المفارقُ للجماعةِ",
    lien: "https://dorar.net/hadith/sharh/73887",
    autres: "مسلم (1676)",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6922,
    texte: "أُتيَ عَليٌّ رَضيَ اللهُ عنه بزَنادِقةٍ فأحرَقَهم ... ",
    lien: "https://dorar.net/hadith/sharh/5704",
    autres: "من أفراد البخاري على مسلم",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1399,
    texte: "واللَّهِ لَأُقَاتِلَنَّ مَن فَرَّقَ بيْنَ الصَّلَاةِ والزَّكَاةِ ",
    lien: "https://dorar.net/hadith/sharh/67078",
    autres:
      "البخاري (7284، 7285)، ومسلم (20)، وأبو داود (1556)، والترمذي (2607) واللفظ له، والنسائي (3970)، وأحمد (117)",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4351,
    texte: "« إني لم أومر أن أنقب عن قلوب الناس ولا أشق بطونهم » ",
    lien: "https://dorar.net/hadith/sharh/984",
    autres: "مسلم (1064).",
  },
  {
    auteur: "صحيح النسائي",
    numero: 4079,
    texte:
      "انَ رجلٌ منَ الأنصارِ أسلمَ ثمَّ ارتدَّ ولحقَ بالشِّرْكِ ثمَّ تندَّمَ ",
    lien: "https://dorar.net/hadith/sharh/85639",
    autres: "أحمد (2218) بنحوه، والطبري في ((التفسير)) (7360)",
  },
  {
    auteur: "صحيح أبي داود",
    numero: 4359,
    texte: " أما كان فيكم رجلٌ رشيدٌ ... عبدُ اللهِ بنُ أبي السَّرحِ",
    lien: "https://dorar.net/hadith/sharh/30712",
    autres:
      " https://tafsir.app/tabari/6/92?utm_source=chatgpt.com النسائي (4067)، والحاكم (4360)",
    Tabari: "https://tafsir.app/tabari/6/92?utm_source=chatgpt.com",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 3518,
    texte: "دَعْه، لا يَتَحَدَّثُ النَّاسُ أنَّ مُحَمَّدًا يَقتُلُ أصحابَه. ",
    lien: "https://dorar.net/hadith/sharh/21796",
    autres: "مسلم (2584).",
  },
];

// 6- Couper la main du voleur -->
const souratesCouperMainVoleurs = [5, ];
const versetsCouperMainVoleurs = [38, ];
const ahadithsCouperMainVoleurs = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4304,
    texte:
      " والذي نفسُ محمدٍ بيدِه لو أن فاطمةَ بنتَ محمدٍ سَرَقَتْ لقَطَعَتُ يدَها. ",
    lien: "https://dorar.net/hadith/sharh/2028",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2648,
    texte:
      "كانت امرأةٌ مخزوميَّةٌ تستعيرُ المتاعَ وتجحَدُه  فقطع النَّبيُّ صلَّى اللهُ عليه وسلَّم يدَها ...  ",
    lien: "https://dorar.net/hadith/sharh/33105",
    autres:
      " مسلم (1688)، وأبو داود (4397) واللفظ له، والنسائي (4898)، وأحمد (25297) ",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6795,
    texte: "  أن النبيَّ صلى الله عليه وسلم قَطَعَ يدَ سارقٍ ",
    lien: "https://dorar.net/hadith/sharh/30720",
    autres: "مسلم (1686)  أبو داود (4386)  النسائي (4909)",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6789,
    texte: " لَا تُقْطَعُ يَدُ السَّارِقِ إلَّا في رُبْعِ دِينَارٍ فَصَاعِدًا.",
    lien: "https://dorar.net/hadith/sharh/4920",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4304,
    texte:
      "والذي نَفْسُ مُحَمَّدٍ بيَدِهِ، لو أنَّ فاطِمَةَ بنْتَ مُحَمَّدٍ سَرَقَتْ، لَقَطَعْتُ يَدَها. ثُمَّ أمَرَ رَسولُ اللَّهِ صلَّى اللهُ عليه وسلَّمَ بتِلْكَ المَرْأَةِ، فَقُطِعَتْ يَدُها، فَحَسُنَتْ تَوْبَتُها بَعْدَ ذلكَ وتَزَوَّجَتْ. قالَتْ عائِشَةُ: فَكانَتْ تَأْتي بَعْدَ ذلكَ فأرْفَعُ حاجَتَها إلى رَسولِ اللَّهِ صلَّى اللهُ عليه وسلَّمَ. ",
    lien: "https://dorar.net/hadith/sharh/82722",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5357,
    texte: " كان يبيعُ نخلَ بني النضيرِ ، ويحبِسُ لأهْلِهِ قوتَ سنتِهم",
    lien: "https://dorar.net/hadith/sharh/24736",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6783,
    texte:
      " لعن اللهُ السارقَ يسرقُ البيضةَ فتُقطَعُ يدُه ويسرقُ الحبلَ فتُقطَعُ يدُه ",
    lien: "https://dorar.net/hadith/sharh/12804",
    autres: "مسلم (1687)",
  },
  {
    auteur: " أبو داود ",
    numero: 4410,
    texte:
      "  جيءَ بِسارقٍ إلى النَّبيِّ صلَّى اللَّهُ عليهِ وسلَّمَ فَقالَ : اقتُلوهُ ",
    lien: "https://dorar.net/h/INaGhEMw?osoul=1",
    autres: " النسائي (4978) ",
  },
  {
    auteur: "  إرواء الغليل",
    numero: 2425,
    texte: " لا يُقطعُ السارقُ حتى يشهدَ على نفسه مرتينِ ",
    lien: "https://dorar.net/h/ka92o90C?osoul=1",
    autres:
      " أخرجه البيهقي في ((معرفة السنن والآثار)) (17223) بنحوه، وعبد الرزاق (18783)، والطحاوي في ((معاني الآثار)) (4980) ",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6794,
    texte:
      "  أن رسولَ اللهِ صلى الله عليه وسلم قَطَعَ في مَجِنٍّ ثمنُه ثلاثةُ دراهمَ. ",
    lien: "https://dorar.net/hadith/sharh/15677",
    autres: "  النسائي (4908)  مسلم (1685)",
  },
  {
    auteur: "صحيح أبي داود",
    numero: 4394,
    texte: "  فهلَّا كان هذا قبل أن تأتيَني به ",
    lien: "https://dorar.net/hadith/sharh/72363",
    autres: " ابن ماجه (2595) النسائي (4883) ",
  },
  {
    auteur: " الترمذي",
    numero: 1450,
    texte: " لا تُقطَعُ الأيدي في الغَزوِ. ",
    lien: "https://dorar.net/h/3G96HTOC",
    autres: "  النسائي (4979) ",
  },
  {
    auteur: " صحيح أبي داود ",
    numero: 4408,
    texte: "  لا تُقطَعُ الأيدي في السَّفَرِ",
    lien: "https://dorar.net/hadith/sharh/30811",
    autres: "  النسائي (4979) الترمذي (1450)، وأحمد (17626)",
  },
  {
    auteur: " صحيح أبي داود ",
    numero: 4388,
    texte: " لا قَطْعَ في ثَمَرٍ ولا كَثَرٍ ",
    lien: "https://dorar.net/hadith/sharh/30728",
    autres:
      " الترمذي (1449)، والنسائي (4960)، وابن ماجه (2593)، وأحمد (15804) ",
  },
  {
    auteur: " البدر المنير",
    numero: 8 / 679,
    texte: " عن عمرَ رضيَ اللهُ عنهُ أنَّه لا قطْعَ في عامِ المجاعةِ ",
    lien: "https://dorar.net/h/1Qj8cRvg",
    autres:
      "  تاريخ أصبهان (1/162)   ضعف الحديث الألباني في السلسلة الضعيفة (1673)",
  },
];

// 7- Fouettement des fornicateurs et alccol -->

const souratesFouettementFornicateurs = [4, 24,24,24,24,24,];
const versetsFouettementFornicateurs = [25, 2,3,4,13,14,];
const ahadithsFouettementFornicateurs = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6779,
    texte:
      "أنَّ نَبِيَّ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ جَلَدَ في الخَمْرِ بالجَرِيدِ، وَالنِّعَالِ",
    lien: "https://dorar.net/hadith/sharh/11200",
    autres: "أبو داود (4479)، والترمذي (1443)",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2234,
    texte: " إذا زَنَت أمةُ أحَدِكُم، فتَبَيَّنَ زِناها، فليَجلِدْها الحَدَّ ...",
    lien: "https://dorar.net/hadith/sharh/15817",
    autres: " مسلم (1703)",
  },

  {
    auteur: "صحيح أبي داود",
    numero: 4413,
    texte:
      " وَاللَّاتِي يَأْتِينَ الْفَاحِشَةَ مِنْ نِسَائِكُمْ فَاسْتَشْهِدُوا عَلَيْهِنَّ أَرْبَعَةً مِنْكُمْ ...",
    lien: "https://dorar.net/hadith/sharh/126384",
    autres: " البيهقي (17357)",
  },
  {
    auteur: " الترمذي ",
    numero: 1438,
    texte:
      "أنَّ النَّبيَّ صلَّى اللَّهُ عليهِ وسلَّمَ ضربَ وغرَّب ، وأنَّ أبا بَكرٍ ضربَ وغرَّبَ ، وأنَّ عُمَرَ ضربَ وغرَّبَ ",
    lien: "https://dorar.net/hadith/sharh/110828",
    autres: " النسائي في ((السنن الكبرى)) (7342)، والحاكم (8105)",
  },

  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6777,
    texte:
      " أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ ضَرَبَ في الخَمْرِ بالجَرِيدِ والنِّعالِ، وجَلَدَ أبو بَكْرٍ أرْبَعِينَ.",
    lien: "https://dorar.net/hadith/sharh/11762",
  },
];

// 8- Lapidation des adultères -->

const souratesLapidationAdulteres = [4,24,24,24,24,115];
const versetsLapidationAdulteres = [25,6,7,8,9,1];
const ahadithsLapidationAdulteres = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6812,
    texte:
      " عَنْ عَلِيٍّ رَضِيَ اللَّهُ عنْه حِينَ رَجَمَ المَرْأَةَ يَومَ الجُمُعَةِ، وقالَ: قدْ رَجَمْتُهَا بسُنَّةِ رَسولِ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ.",
    lien: "https://dorar.net/hadith/sharh/67065",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6841,
    texte:
      " أنَّ اليَهودَ جاؤوا إلى النَّبيِّ صلَّى اللهُ عليه وسلَّم برَجُلٍ منهم وامرَأةٍ قد زَنَيا ...  فأمَرَ بهِما فرُجِما",
    lien: "https://dorar.net/hadith/sharh/11200",
    autres: "أبو داود (4479)، والترمذي (1443)",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6840,
    texte:
      " رَجَمَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ فَقُلتُ: أقَبْلَ النُّورِ أمْ بَعْدَهُ؟ قالَ: لا أدْرِي.",
    lien: "https://dorar.net/hadith/sharh/11551",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6830,
    texte:
      " فَكانَ فيما أُنزِلَ عليهِ آيةُ الرَّجمِ، فقرأناها ووَعيناها، ورجمَ رسولُ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ، ورجمنا من بعدِهِ ... ",
    lien: "https://dorar.net/hadith/sharh/36779",
    autres: " مسلم (1691) أبو داود (4418) أحمد (156)",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 6824,
    texte:
      " « أَنَّ مَاعِزَ بْنَ مَالِكٍ أَتَى النَّبِيَّ ﷺ فَأَقَرَّ بِالزِّنَا… فَأَمَرَ بِهِ فَرُجِمَ ",
    lien: "https://dorar.net/hadith/sharh/139921",
    autres: "  النسائي (7204)، وأحمد (9809)",
  },
  {
    auteur: " صحيح أبي داود ",
    numero: 4440,
    texte:
      " « أَنَّ امْرَأَةً مِنْ جُهَيْنَةَ أَتَتِ النَّبِيَّ ﷺ وَهِيَ حُبْلَى مِنَ الزِّنَا… فَأَمَرَ بِهَا فَرُجِمَتْ ",
    lien: "https://dorar.net/hadith/sharh/17250",
    autres:
      " مسلم (1696)، والنسائي (1957)، بلفظ مقارب، وابن ماجه (2555)، مختصرا. ",
  },
  {
    auteur: " صحيح مسل ",
    numero: 1690,
    texte:
      " خُذُوا عَنِّي، خُذُوا عَنِّي، قَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلًا،البِكْرُ بِالبِكْرِ جَلْدُ مِائَةٍ وَنَفْيُ سَنَةٍ،وَالثَّيِّبُ بِالثَّيِّبِ جَلْدُ مِائَةٍ وَالرَّجْمُ » ",
    lien: "https://dorar.net/hadith/sharh/17294",
    autres:
      "  أحمد (22703)، والنسائي في ((الكبرى)) (7926)، وابن حبان (4443) باختلاف يسير. ",
  },
  {
    auteur: " صحيح البخاري ",
    numero: 3849,
    texte:
      " رَأيتُ في الجاهِليَّةِ قِردةً اجتَمع عليها قِرَدةٌ، قد زَنَت، فرَجَموها، فرَجَمتُها معهُم. ",
    lien: "https://dorar.net/hadith/sharh/150656",
    autres:
      "  ابن أبي خيثمة في ((التاريخ)) (6137)، والخرائطي في ((مساوئ الأخلاق)) (469)، وأبو نعيم الأصبهاني في ((معرفة الصحابة)) (5139) جميعهم باختلاف يسير. ",
  },
  {
    auteur: " صحيح البخاري ",
    numero: 6633,
    texte:
      " ... أما والذي نَفسي بيَدِه، لَأقضيَنَّ بينَكُما بكِتابِ اللهِ،  ... ",
    lien: "https://dorar.net/hadith/sharh/559",
    autres: " مسلم  1697  أبو داود (4445)، والترمذي (1433)",
  },
];

// 9- La violence contre les homosexuels -->
const souratesViolenceHomosexuels = [7,7, 11,11,11, 26,26, 27,27, 29,29, 21];
const versetsViolenceHomosexuels = [80,81, 77,78,79, 165,166, 54,55, 28,29, 74, ];
const ahadithsViolenceHomosexuels = [
  {
    auteur: "صحيح الجامع",
    numero: 5891,
    texte: " لَعَنَ اللَّهُ مَنْ عَمِلَ عَمَلَ قَوْمِ لُوطٍ ...",
    lien: "https://dorar.net/hadith/sharh/116214",
    autres: " أحمد (1875)  ابن حبان (4417)، والطبراني (11/218) (11546)",
  },
  {
    auteur: "  صحيح الترمذي ",
    numero: 1457,
    texte: "  إنَّ أخوَفَ ما أخافُ على أمَّتي من عملِ قومِ لوطٍ",
    lien: "https://dorar.net/hadith/sharh/72929",
    autres: " ابن ماجه (2563)، وأحمد (15093) ",
  },

  {
    auteur: " صحيح أبي داود",
    numero: 4462,
    texte:
      " مَنْ وجدتُموهُ يعملُ عملَ قومِ لوطٍ ، فاقتلوا الفاعلَ والمفعولَ بهِ",
    lien: "https://dorar.net/hadith/sharh/120445",
    autres: " الترمذي (1456)، وابن ماجه (2561)، وأحمد (2732) ",
  },
  {
    auteur: "  التعليقات الرضية",
    numero: 284,
    texte: " ينظرُ أعلى بناءٍ في القريةِ ؛ فيرمى به مُنكََّسًا ، ثم يُتْبَعُ الحجارةَ .",
    lien: "https://dorar.net/h/PNKHTUsX?sims=1",
    autres: " الراوي : [أبو نضرة المنذر بن مالك] | المحدث : ابن حجر العسقلاني | المصدر : الدراية تخريج أحاديث الهداية الصفحة أو الرقم : 2/103 ",
    },
  
];

// 10- Exécutions
const souratesDjihadViolencesExecutions = [4, 60];
const versetsDjihadViolencesExecutions = [88, 1];
const ahadithsDjihadViolencesExecutions = [
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 5295,
    texte:
      " أنَّ يَهُودِيًّا قَتَلَ جَارِيَةً علَى أوْضَاحٍ لَهَا، فَقَتَلَهَا بحَجَرٍ، فَجِيءَ بهَا إلى النبيِّ صَلَّى اللهُ عليه وسلَّمَ وبِهَا رَمَقٌ، فَقالَ: أقَتَلَكِ فُلَانٌ؟ فأشَارَتْ برَأْسِهَا: أنْ لَا، ثُمَّ قالَ الثَّانِيَةَ، فأشَارَتْ برَأْسِهَا: أنْ لَا، ثُمَّ سَأَلَهَا الثَّالِثَةَ، فأشَارَتْ برَأْسِهَا: أنْ نَعَمْ، فَقَتَلَهُ النبيُّ صَلَّى اللهُ عليه وسلَّمَ بحَجَرَيْنِ.",
    lien: "https://dorar.net/hadith/sharh/8019",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1884,
    texte:
      " رَجَعَ نَاسٌ مِن أصْحَابِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ مِن أُحُدٍ، وكانَ النَّاسُ فيهم فِرْقَتَيْنِ: فَرِيقٌ يقولُ: اقْتُلْهُمْ، وفَرِيقٌ يقولُ: لَا، فَنَزَلَتْ: {فَما لَكُمْ في المُنَافِقِينَ فِئَتَيْنِ}",
    lien: "https://dorar.net/hadith/sharh/6072",
    autres: 4589,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4339,
    texte:
      " اللَّهُمَّ إنِّي أبْرَأُ إلَيْكَ ممَّا صَنَعَ خَالِدُ بنُ الوَلِيدِ مَرَّتَيْنِ.",
    lien: "https://dorar.net/hadith/sharh/24160",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4274,
    texte:
      " فَقالَ عُمَرُ: يا رَسولَ اللَّهِ، دَعْنِي أضْرِبْ عُنُقَ هذا المُنَافِقِ، فَقالَ: إنَّه قدْ شَهِدَ بَدْرًا، وما يُدْرِيكَ لَعَلَّ اللَّهَ اطَّلَعَ علَى مَن شَهِدَ بَدْرًا، فَقالَ: اعْمَلُوا ما شِئْتُمْ؛ فقَدْ غَفَرْتُ لَكُمْ. فأنْزَلَ اللَّهُ السُّورَةَ: {يَاأَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَقَدْ كَفَرُوا بِمَا جَاءَكُمْ مِنَ الْحَقِّ} إلى قَوْلِهِ: {فقَدْ ضَلَّ سَوَاءَ السَّبِيلِ} [الممتحنة: 1]",
    lien: "https://dorar.net/hadith/sharh/117689",
    autres: 2494,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4286,
    texte:
      " عن أنسِ بنِ مالكٍ, أنَّ رسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم دخل مكةَ عامَ الفتحِ, وعلى رأسِه المغفَرُ, فلما نزعَه, جاءَه رجلٌ فقال : ابنُ خطلٍ متعلِّقٌ بأستارِ الكعبةِ, فقال ( رسولُ اللهِ صلَّى اللهُ عليهِ وسلَّم ) اقتلوهُ",
    lien: "https://dorar.net/hadith/sharh/79443",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4192,
    texte:
      " ... فأمرَ بِهِم فقُطِعَت أيديهم وأرجلُهُم وسمرَ أعينُهُم ، وألقَوا في الحرَّةِ يستَسقونَ فلا يُسقونَ",
    lien: "https://dorar.net/hadith/sharh/10926",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 1501,
    texte:
      " فَأُتِيَ بهِمْ، فَقَطَّعَ أيْدِيَهُمْ وأَرْجُلَهُمْ، وسَمَرَ أعْيُنَهُمْ، وتَرَكَهُمْ بالحَرَّةِ يَعَضُّونَ الحِجَارَةَ.",
    lien: "https://dorar.net/hadith/sharh/33629",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4037,
    texte: "مَن لِكَعْبِ بنِ الأشْرَفِ؛ فإنَّه قدْ آذَى اللَّهَ ورَسولَهُ؟ ",
    lien: "https://dorar.net/hadith/sharh/4176",
    autres: 2510,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2541,
    texte:
      " إنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّمَ أغَارَ علَى بَنِي المُصْطَلِقِ وهُمْ غَارُّونَ، وأَنْعَامُهُمْ تُسْقَى علَى المَاءِ، فَقَتَلَ مُقَاتِلَتَهُمْ، وسَبَى ذَرَارِيَّهُمْ، وأَصَابَ يَومَئذٍ جُوَيْرِيَةَ.",
    lien: "https://dorar.net/hadith/sharh/7139",
    autres: 3804,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2926,
    texte:
      " لا تَقُومُ السَّاعَةُ حتَّى تُقاتِلُوا اليَهُودَ، حتَّى يَقُولَ الحَجَرُ وراءَهُ اليَهُودِيُّ: يا مُسْلِمُ، هذا يَهُودِيٌّ وَرائي فاقْتُلْهُ.",
    lien: "https://dorar.net/hadith/sharh/15003",
    autres: 3593,
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4039,
    texte:
      "  بَعَثَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ رَهْطًا مِنَ الأنْصَارِ إلى أبِي رَافِعٍ فَدَخَلَ عليه عبدُ اللَّهِ بنُ عَتِيكٍ بَيْتَهُ لَيْلًا فَقَتَلَهُ وهو نَائِمٌ.",
    lien: "https://dorar.net/hadith/sharh/24040",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 4050,
    texte:
      " أنَّ النبيَّ صَلَّى اللَّهُ عليه وَسَلَّمَ خَرَجَ إلى أُحُدٍ، فَرَجَعَ نَاسٌ مِمَّنْ كانَ معهُ، فَكانَ أَصْحَابُ النبيِّ صَلَّى اللَّهُ عليه وَسَلَّمَ فيهم فِرْقَتَيْنِ، قالَ بَعْضُهُمْ: نَقْتُلُهُمْ، وَقالَ بَعْضُهُمْ: لَا، فَنَزَلَتْ {فَما لَكُمْ في المُنَافِقِينَ فِئَتَيْنِ} [النساء: 88].",
    lien: "https://dorar.net/hadith/sharh/6074",
  },
  {
    auteur: "El Boukhari صحيح البخاري",
    numero: 2813,
    texte:
      "لَمَّا رَجَعَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ مِنَ الخَنْدَقِ، ووَضَعَ السِّلَاحَ واغْتَسَلَ، أتَاهُ جِبْرِيلُ عليه السَّلَامُ، فَقالَ: قدْ وضَعْتَ السِّلَاحَ؟ واللَّهِ ما وضَعْنَاهُ، فَاخْرُجْ إليهِم قالَ: فَإِلَى أيْنَ؟ قالَ: هَا هُنَا، وأَشَارَ إلى بَنِي قُرَيْظَةَ، فَخَرَجَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إليهِم ",
    lien: "https://dorar.net/hadith/sharh/21196",
    autres: 4117,
  },
  {
    auteur: "صحيح النسائي",
    numero: 4078,
    texte: " اقتُلوهم وإن وجَدتُموهم متَعلِّقينَ بأَستارِ الكَعبةِ ",
    lien: "https://dorar.net/hadith/sharh/138269",
    autres: "أبو داود (2683)",
  },
];